/*
 * 
 * This license is set out in https://raw.githubusercontent.com/Broadcom-Network-Switching-Software/OpenBCM/master/Legal/LICENSE file.
 * 
 * Copyright 2007-2020 Broadcom Inc. All rights reserved.
 *
 * File:        metrolite.c
 * Purpose:
 * Requires:
 */


#include <sal/core/boot.h>

#include <soc/katana2.h>
#include <soc/metrolite.h>
#include <soc/saber2.h>
#include <soc/trident.h>
#include <soc/bradley.h>
#include <soc/drv.h>
#include <soc/error.h>
#include <soc/debug.h>
#include <soc/mem.h>
#include <soc/hash.h>
#include <soc/shmoo_and28.h>
#include <soc/phy/ddr34.h>
#include <soc/mspi.h>
#include <soc/phyreg.h>
#include <soc/iproc.h>
#include <shared/bsl.h>
#include <soc/scache.h>
#include <soc/bondoptions.h>

#ifdef BCM_METROLITE_SUPPORT

#ifdef BCM_WARM_BOOT_SUPPORT

/* Basic WB version. */
#define BCM_WB_VERSION_1_0                SOC_SCACHE_VERSION(1,0)

/* Default Version - Latest */
#define BCM_WB_DEFAULT_VERSION            BCM_WB_VERSION_1_0

/* Default Scache Partition - Latest */
#define BCM_FLEXIO_SCACHE_DEFAULT_PARTITION     0x1

static uint8  scache_begin_magic_number[]={0xAA,0xBB,0xCC,0xDD};
static uint8  scache_end_magic_number[]={0xDD,0xCC,0xBB,0xAA};
static bcm56270_tdm_info_t ml_scache_tdm_info={0};
static uint32 ml_scache_tdm[ML_TDM_MAX_SIZE]={0};
static uint32 ml_scache_speed[ML_MAX_PHYSICAL_PORTS]={0};
static soc_port_details_t ml_scache_port_details[ML_MAX_PHYSICAL_PORTS+1]={{0}};

               ml_speed_56270_0,          /* Dummy */
               ml_speed_56270_1,
               ml_speed_56271_1,
               ml_speed_56271_2,
               ml_speed_56271_3,
               ml_speed_56272_1,
               ml_speed_56272_2,
               ml_speed_56270_1,
               ml_speed_56271_1
#ifdef BCM_WARM_BOOT_SUPPORT
               ,ml_scache_speed /* Dummy speed reserved for WB*/
#endif
};

ml_port_to_block_subports_t
        *ml_port_to_block_subports[SOC_MAX_NUM_DEVICES] = {NULL};
ml_port_to_block_subports_t ml_port_to_block_subports_s = {
                                                 0,1,2,3, /* 1-4   mxq0 */
                                                 0,1,2,3, /* 5-8   xl0  */
                                                 0,1,2,3  /* 9-12  xl1  */
};

static ml_port_to_block_t *ml_port_to_block[SOC_MAX_NUM_DEVICES] = {NULL};
static ml_port_to_block_t ml_port_to_block_s = {
                                        0,0,0,0, /* 1-4   mxq0 */
                                        1,1,1,1, /* 5-8   xl0  */
                                        2,2,2,2  /* 9-12  xl1  */
};

ml_block_ports_t *ml_block_ports[SOC_MAX_NUM_DEVICES] = {NULL};
ml_block_ports_t ml_block_ports_s = {
                                     {1,2,3,4},
                                     {5,6,7,8},
                                     {9,10,11,12},
};

ml_port_speeds_t *ml_port_speeds[SOC_MAX_NUM_DEVICES] = {NULL};
const static  ml_port_speeds_t ml_port_speeds_56270_0 = {{0,0,0,0}};
const static  ml_port_speeds_t ml_port_speeds_56270_1 = {
              {10000,0,0,2500},{10000,10000,0,10000},{11000,11000,0,11000}};
const static  ml_port_speeds_t ml_port_speeds_56271_1 = {
              {10000,0,0,2500},{10000,10000,0,10000},{10000,0,0,2500}};
const static  ml_port_speeds_t ml_port_speeds_56271_2 = {
              {10000,0,0,2500},{10000,0,0,0},{10000,10000,0,0}};
const static  ml_port_speeds_t ml_port_speeds_56271_3 = {
              {10000,0,0,2500},{10000,0,0,0},{11000,11000,0,11000}};
const static  ml_port_speeds_t ml_port_speeds_56272_1 = {
              {1000,0,0,1000},{2500,0,0,0},{1000,1000,0,1000}};
const static  ml_port_speeds_t ml_port_speeds_56272_2 = {
              {1000,0,0,1000},{2500,0,0,0},{1000,1000,0,0}};

ml_port_speeds_t *ml_port_speeds_s[] = {
               (ml_port_speeds_t*)ml_port_speeds_56270_0,   /* Dummy */
               (ml_port_speeds_t*)ml_port_speeds_56270_1,
               (ml_port_speeds_t*)ml_port_speeds_56271_1,
               (ml_port_speeds_t*)ml_port_speeds_56271_2,
               (ml_port_speeds_t*)ml_port_speeds_56271_3,
               (ml_port_speeds_t*)ml_port_speeds_56272_1,
               (ml_port_speeds_t*)ml_port_speeds_56272_2,
               (ml_port_speeds_t*)ml_port_speeds_56270_1,
               (ml_port_speeds_t*)ml_port_speeds_56271_1
#ifdef BCM_WARM_BOOT_SUPPORT
               ,(ml_port_speeds_t*)ml_port_speeds_scache
#endif
};

ml_tdm_pos_info_t ml_tdm_pos_info[ML_MAX_BLOCKS]={{0}};

typedef struct tdm_port_slots_info_s  {
        int32  position;
        struct tdm_port_slots_info_s *prev;
        struct tdm_port_slots_info_s *next;
}tdm_port_slots_info_t;

tdm_port_slots_info_t ml_tdm_port_slots_info[ML_MAX_LOGICAL_PORTS];

uint32 ml_current_tdm[ML_TDM_MAX_SIZE]={0};
uint32 ml_current_tdm_size=0;
static uint8  old_tdm_no=0;

/* TDM_A : 0:180MHz: 209 (19 * 11) Cycles Used */
#define ML_TDM_A_SIZE   204
#define ML_TDM_A_FREQ   180 
#define ML_TDM_A_ROW    19
#define ML_TDM_A_COL    11 
const static uint32 ml_tdm_56270_A_ref[ML_TDM_A_SIZE] = {
       /*Col:1*/ /*Col:2*/ /*Col:3*/ /*Col:4*/ /*Col:5*/ /*Col:6*/ /*Col:7*/ /*Col:8*/ /*Col:9*/ /*Col:10*/ /*Col:11*/
/*1*/   5,		  6,		7,		  8,	    1,		  9,	    10,       11,       12,       5,         2,    
/*2*/	6, 		  7,		8,		  9,	    3,		  10,		11,       12,	    5,	      6,         4,
/*3*/	7,		  8,		9,		  10,	    ML_IDLE,  ML_IDLE,	11,       12,       5,        6,         7,
/*4*/	8,		  9,		10,		  11,	    1,		  12,		5,        6,        7,        8,         2,
/*5*/	9,		  10,		11,		  12,	    3,  	  5,		6,        7,        8,        9,         4,
/*6*/	10,		  11,		12,		  5,	    ML_LPBK,  6,		7,	      8,        9,        10,        ML_CMIC,
/*7*/	11,		  12,		5,		  6,	    ML_LPBK,  7,		8,        9,        10,       11,        ML_CMIC,
/*8*/	12,		  5,		6,		  7,	    1,		  8,		9,        10,       11,       12,        2,
/*9*/	5,		  6,		7,		  8,	    3,		  9,		10,       11,       12,       5,         4,
/*10*/	6,		  7,		8,		  9,	    ML_IDLE,  ML_IDLE,	10,       11,       12,       5,         6,
/*11*/	7,		  8,		9,		  10,	    1,		  11,		12,       5,        6,        7,         2,
/*12*/	8,		  9,		10,		  11,	    3,		  12,		5,        6,        7,        8,         4,
/*13*/	9,		  10,		11,		  12,	    ML_LPBK,  5,		6,        7,        8,        9,         ML_CMIC,
/*14*/	10,		  11,		12,		  5,	    ML_LPBK,  6,		7,        8,        9,        10,        ML_CMIC,
/*15*/	11,		  12,		5,		  6,	    1,		  7,		8,        9,        10,       11,        2,
/*16*/	12,		  5,		6,		  7,	    3,		  8,		9, 	      10,       11,       12,        4,
/*17*/	5,		  6,		7,		  8,	    ML_IDLE,  ML_IDLE,	9,	      10,       11,       12,        5,
/*18*/	6,		  7,		8,		  9,	    ML_LPBK,  10,		11,	      12,       5,        6,         ML_IDLE,
/*19*/	7,		  8,		9,		  10,	    11,		  12		/* ------------------ EMPTY ----------------------*/
};

/* TDM_C : 0:125MHz: 147(21 * 7) Cycles Used */
#define ML_TDM_C_SIZE   140
#define ML_TDM_C_FREQ   125 
#define ML_TDM_C_ROW    21
#define ML_TDM_C_COL    7 
const static uint32 ml_tdm_56271_C_ref[ML_TDM_C_SIZE] = {
       /*Col:1*/ /*Col:2*/ /*Col:3*/ /*Col:4*/ /*Col:5*/ /*Col:6*/ /*Col:7*/   
/*1*/	5,		  6,		7,		  8,	    1,		  9,	  	ML_CMIC, 
/*2*/	5, 		  6,		7,		  8,	    2,		  10,		ML_LPBK,
/*3*/	5,		  6,		7,		  8,	    3,     	  11,		ML_IDLE,
/*4*/	5,		  6,		7,		  8,	    4,		  12,		/* EMPTY */
/*5*/	5,		  6,		7,		  8,	    1,        9,		/* EMPTY */
/*6*/	5,		  6,		7,		  8,	    2,        10,		ML_LPBK,
/*7*/	5,		  6,		7,		  8,	    3,		  11,		ML_CMIC,
/*8*/	5,		  6,		7,		  8,	    4,		  12,		ML_IDLE,
/*9*/	5,		  6,		7,		  8,	    1,		  9,		/* EMPTY */
/*10*/	5,		  6,		7,		  8,	    2,		  10,		ML_LPBK,
/*11*/	5,		  6,		7,		  8,	    3,		  11,		ML_IDLE,
/*12*/	5,		  6,		7,		  8,	    4,		  12,		/* EMPTY */
/*13*/	5,		  6,		7,		  8,	    1,		  9,		ML_CMIC,
/*14*/	5,		  6,		7,		  8,	    2,		  10,		ML_LPBK,
/*15*/	5,		  6,		7,		  8,	    3,		  11,		ML_IDLE,
/*16*/	5,		  6,		7,		  8,	    4,		  12,		/* EMPTY */	
/*17*/	5,		  6,		7,		  8,	    1,		  9,		/* EMPTY */
/*18*/	5,		  6,		7,		  8,	    2,		  10,		ML_LPBK,
/*19*/	5,		  6,		7,		  8,	    3,		  11,		ML_CMIC,
/*20*/	5,		  6,		7,		  8,	    4,		  12,		ML_IDLE,
/*21*/	5,		  6,		7,		  8,	    ML_IDLE,  ML_IDLE	/* EMPTY */
};


/* TDM_B : 0:30MHz: 16 (4 * 4) Cycles Used */
#define ML_TDM_B_SIZE    16
#define ML_TDM_B_FREQ    30 
#define ML_TDM_B_ROW     4
#define ML_TDM_B_COL     4 
const static uint32 ml_tdm_56272_B_ref[ML_TDM_B_SIZE] = {
      /*Col:1*/ /*Col:2*/ /*Col:3*/ /*Col:4*/
/*1*/  ML_IDLE,	 1,		   9,		 5,
/*2*/  ML_CMIC,	 2,		   10,		 5,
/*3*/  ML_LPBK,	 3,		   11,		 5,
/*4*/  ML_CMIC,	 4,		   12,		 ML_IDLE
};

/* TDM related functions and structures */
static bcm56270_tdm_info_t bcm56270_tdm_info[]={
            {0, 0, 0, 0},                     /* Dummy */
            /* 56270_1 Cfg=1:IntCfg=1 */
            {ML_TDM_A_FREQ, ML_TDM_A_SIZE, ML_TDM_A_ROW, ML_TDM_A_COL},

            /* 56271_1 Cfg=1:IntCfg=2 */
            {ML_TDM_C_FREQ, ML_TDM_C_SIZE, ML_TDM_C_ROW, ML_TDM_C_COL},

            /* 56271_2 Cfg=2:IntCfg=3 */
            {ML_TDM_C_FREQ, ML_TDM_C_SIZE, ML_TDM_C_ROW, ML_TDM_C_COL},

            /* 56271_3 Cfg=3:IntCfg=4 */
            {ML_TDM_C_FREQ, ML_TDM_C_SIZE, ML_TDM_C_ROW, ML_TDM_C_COL},


            /* 56272_1 Cfg=1:IntCfg=5 */
            {ML_TDM_B_FREQ, ML_TDM_B_SIZE, ML_TDM_B_ROW, ML_TDM_B_COL},

            /* 56272_2 Cfg=1:IntCfg=6 */
            {ML_TDM_B_FREQ, ML_TDM_B_SIZE, ML_TDM_B_ROW, ML_TDM_B_COL},


            /* 53460_1 Cfg=1:IntCfg=1 */
            {ML_TDM_A_FREQ, ML_TDM_A_SIZE, ML_TDM_A_ROW, ML_TDM_A_COL},

            /* 53461_1 Cfg=1:IntCfg=2 */
            {ML_TDM_C_FREQ, ML_TDM_C_SIZE, ML_TDM_C_ROW, ML_TDM_C_COL}
#ifdef BCM_WARM_BOOT_SUPPORT
            ,{0, 0, 0, 0},
#endif
};

static uint32 ml_tdm_A_56270_0[ML_TDM_A_SIZE]={0}; /* Dummy */
static uint32 ml_tdm_A_56270_1[ML_TDM_A_SIZE]={0}; /* Filled up Runtime */
static uint32 ml_tdm_C_56271_1[ML_TDM_C_SIZE]={0}; /* Filled up Runtime */
static uint32 ml_tdm_C_56271_2[ML_TDM_C_SIZE]={0}; /* Filled up Runtime */
static uint32 ml_tdm_C_56271_3[ML_TDM_C_SIZE]={0}; /* Filled up Runtime */
static uint32 ml_tdm_B_56272_1[ML_TDM_B_SIZE]={0}; /* Filled up Runtime */
static uint32 ml_tdm_B_56272_2[ML_TDM_B_SIZE]={0}; /* Filled up Runtime */

static uint32 *bcm56270_tdm[]={
               ml_tdm_A_56270_0,   /* Dummy to match cfg_num and index */
               ml_tdm_A_56270_1,   /* 56270 Cfg=1:IntCfg=1 */
               ml_tdm_C_56271_1,   /* 56271 Cfg=1:IntCfg=2 */
               ml_tdm_C_56271_2,   /* 56271 Cfg=2:IntCfg=3 */
               ml_tdm_C_56271_3,   /* 56271 Cfg=3:IntCfg=4 */
               ml_tdm_B_56272_1,   /* 56272 Cfg=1:IntCfg=5 */
               ml_tdm_B_56272_2,   /* 56272 Cfg=2:IntCfg=6 */
               ml_tdm_A_56270_1,   /* 53460 Cfg=1:IntCfg=1 */
               ml_tdm_C_56271_1    /* 53461 Cfg=1:IntCfg=1 */
#ifdef BCM_WARM_BOOT_SUPPORT
               ,ml_scache_tdm      /*Dummy TDM reserved for WB */
#endif
};

extern int
bcm_kt2_modid_set(int unit, int *my_modid_list, int *my_modid_valid_list ,
        int *base_port_ptr_list);
int _soc_metrolite_get_cfg_num(int unit, int skip_warmboot, int *new_cfg_num);
extern int
bcm_kt2_modid_set_all(int unit, int *my_modid_list, int *my_modid_valid_list,
        int *base_port_ptr_list);

int _soc_metrolite_get_cfg_num(int unit, int skip_warmboot, int *new_cfg_num) 
{
    int cfg_num=-1;
    int max_cfg_num=0;
    int def_cfg_num=0;
    int offset_cfg_num=0;
    uint16 dev_id=0;
    uint8  rev_id=0;

#ifdef BCM_WARM_BOOT_SUPPORT
    if (SOC_WARM_BOOT(unit) && (!skip_warmboot)) {
        cfg_num = COUNTOF(bcm56270_tdm_info) - 1;
        if (bcm56270_tdm_info[cfg_num].tdm_size != 0) {
            *new_cfg_num = cfg_num;
            return SOC_E_NONE;       
        }
        /* FAll thru */
    }
#endif
    cfg_num = soc_property_get(unit, spn_BCM5627X_CONFIG,0xFF); 

    soc_cm_get_id(unit, &dev_id, &rev_id);

    switch(dev_id) {
    case BCM56270_DEVICE_ID:
         def_cfg_num = BCM56270_DEVICE_ID_DEFAULT_CFG;
         offset_cfg_num = BCM56270_DEVICE_ID_OFFSET_CFG;
         max_cfg_num = BCM56270_DEVICE_ID_MAX_CFG;
         break;
    case BCM56271_DEVICE_ID:
         def_cfg_num = BCM56271_DEVICE_ID_DEFAULT_CFG;
         offset_cfg_num = BCM56271_DEVICE_ID_OFFSET_CFG;
         max_cfg_num = BCM56271_DEVICE_ID_MAX_CFG;
         break;
    case BCM56272_DEVICE_ID:
         def_cfg_num = BCM56272_DEVICE_ID_DEFAULT_CFG;
         offset_cfg_num = BCM56272_DEVICE_ID_OFFSET_CFG;
         max_cfg_num = BCM56272_DEVICE_ID_MAX_CFG;
         break;
    case BCM53460_DEVICE_ID:
         def_cfg_num = BCM56270_DEVICE_ID_DEFAULT_CFG;
         offset_cfg_num = BCM56270_DEVICE_ID_OFFSET_CFG;
         max_cfg_num = BCM56270_DEVICE_ID_MAX_CFG;
         break;
    case BCM53461_DEVICE_ID:
         def_cfg_num = BCM56271_DEVICE_ID_DEFAULT_CFG;
         offset_cfg_num = BCM56271_DEVICE_ID_OFFSET_CFG;
         max_cfg_num = BCM56271_DEVICE_ID_DEFAULT_CFG;
         break;

    default : 
         /* Not supported yet */
         return SOC_E_UNAVAIL; 
    }

    if (cfg_num == 0xFF) {
        *new_cfg_num = def_cfg_num;
    } else {
        if (cfg_num == 0) {
            LOG_DEBUG(BSL_LS_SOC_COMMON, (BSL_META_U(unit, "Config=0 is not allowed\n")));
            return SOC_E_PARAM;
        }   
        *new_cfg_num = cfg_num + offset_cfg_num;
    }           
    if (*new_cfg_num > max_cfg_num) {
        LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                   "Cfg_num:%d Internal cfg_num:%d \n"),cfg_num,*new_cfg_num));
        LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                   "Wrong %s ==> cfg_num:%d DEFAULT:%d START:%d MAX:%d \n"),
                   spn_BCM5627X_CONFIG, cfg_num,
                   def_cfg_num-offset_cfg_num,1,max_cfg_num-offset_cfg_num));
        *new_cfg_num = def_cfg_num;
        return SOC_E_NONE; 
    }              
    LOG_VERBOSE(BSL_LS_SOC_COMMON,
              (BSL_META_U(unit,
               "Info Cfg_num:%d Internal cfg_num:%d \n"),cfg_num,*new_cfg_num));

    return SOC_E_NONE;
}

#if 0
soc_error_t ml_tdm_verify(int unit,
                           uint32 *tdm,
                           uint32 total_tdm_slots,
                           uint32 tdm_freq,    /* In MHHz */
                           uint32 *port_speed,
                           uint32 lpbk_port_speed,
                           uint32 *offender_port) 
{
    /* Following rules need to be met */
    /* Rule1 : Each Loopback port need 2.5G bandwidth */
    /* Rule2 : Each CMIC port need 2G bandwidth       */
    /* Rule3 : Loopback (LPBK) ports require min 3 cycle spacing among LPBK or 
               CMIC ports */ 
    /* Rule4 : Each subport in MXQPORT operates with 4 cycle TDM */
    /* Rule5 : Each 10G-XAUI ports should be able to operate in 4x2.5G with 4 
               slots allocated to each subport from the same MXQPORT */
    soc_error_t           rv=SOC_E_NONE;
    uint32                index=0;
    uint32                expected_tdm_cycles_min=0;
    uint32                expected_tdm_cycles_max=0;
    uint32                tdm_freq_index=0;
    uint32                speed_index=0;
    uint32                port=0;
    uint32                speed=0;
    uint32                worse_tdm_slot_spacing=0;
    uint32                prev_tdm_slot_spacing=0;
    uint32                next_tdm_slot_spacing=0;
#if 0
    uint32                tdm_slot_spacing=0;
#endif
    uint32                min_tdm_cycles=0; /* To Meet BW */
    uint32                count=0; 
    uint32                skip_count=0; 
    uint32                mxqblock=0;
    uint32                outer_port=0;
    uint32                inner_port=0;
    uint32                spacing=0;
    uint32                loop=0;
    tdm_port_slots_info_t *head=NULL;
    tdm_port_slots_info_t *head1=NULL;
    tdm_port_slots_info_t *current=NULL;
    tdm_port_slots_info_t *current1=NULL;
    tdm_port_slots_info_t *prev = NULL;
    tdm_port_slots_info_t *temp=NULL;
    uint32                idle_flag=0;
    uint32                idle_rule=0;
    char                  base_tdm_str[80];

   /* Possible TDM frequencies 
      80MHz(16Cycles) ,120MHz(20Cycles),155MHz(84Cycles),
      185MHz(80Cycles),185MHz(90Cycles) 
    */
    switch(tdm_freq) {
    case 130:
        if (total_tdm_slots == 284) {
            /*TDM_A : 0:130MHz: 284 (41 * 7) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_A : 0:130MHz: 284 (41 * 7) Cycles Used",
                        79);
            tdm_freq_index=0;
            expected_tdm_cycles_min=284;
            expected_tdm_cycles_max=284;
        } else if (total_tdm_slots == 141) {
            /*TDM_C,C1,C2: 7:130MHz: 141 (21 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_AA,TDM_C,C1,C2: 7:130MHz:141 (21 * 6) Cycles Used",
                        79);
            tdm_freq_index=7;
            expected_tdm_cycles_min=141;
            expected_tdm_cycles_max=141;
        } else if (total_tdm_slots == 168) {
            /*TDM_D: 8:130MHz: 168 (28 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_D: 8:130MHz: 168 (28 * 6) Cycles Used",
                        79);
            tdm_freq_index=8;
            expected_tdm_cycles_min=168;
            expected_tdm_cycles_max=168;
        } else {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                      "Unsupported tdm slots:%d\n"),
                      total_tdm_slots));
            return SOC_E_FAIL;
        }
        break;
    case 24:
        /*TDM_A1: 2:24MHz: 13 (4 * 4) Cycles Used */
        sal_strncpy(base_tdm_str, 
                    "TDM_A1: 2:24MHz: 13 (4 * 4) Cycles Used ",
                    79);
        tdm_freq_index=2;
        expected_tdm_cycles_min=13;
        expected_tdm_cycles_max=13;
        break;
    case 37:
        /*TDM_A1A: 3:37MHz: 84 (21 * 4) Cycles Used */
        sal_strncpy(base_tdm_str, 
                    "TDM_A1A: 3:37MHz: 84 (21 * 4) Cycles Used ",
                    79);
        tdm_freq_index=3;
        expected_tdm_cycles_min=84;
        expected_tdm_cycles_max=84;
        break;
    case 118:
        if (total_tdm_slots == 133) {
            /*TDM_B: 4:118MHz: 133 (23 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_B: 4:118MHz: 133 (23 * 6) Cycles Used ",
                        79);
            tdm_freq_index=4;
            expected_tdm_cycles_min=133;
            expected_tdm_cycles_max=133;
        } else if (total_tdm_slots == 120) {
            /*TDM_B1: 5:118MHz: 120 (20 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_B1: 5:118MHz: 120 (20 * 6) Cycles Used ",
                        79);
            tdm_freq_index=5;
            expected_tdm_cycles_min=120;
            expected_tdm_cycles_max=120;
        } else if (total_tdm_slots == 121) {
            /*TDM_B1A: 6:118MHz: 121 (21 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_B1A: 6:118MHz: 121 (21 * 6) Cycles Used ",
                        79);
            tdm_freq_index=6;
            expected_tdm_cycles_min=121;
            expected_tdm_cycles_max=121;
        } else {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                      "Unsupported tdm slots:%d\n"),
                      total_tdm_slots));
            return SOC_E_FAIL;
        }
        break;
    case 75:
        if (total_tdm_slots == 81) {
            /*TDM_E,E1,E3 9:75MHz: 81 (21 * 4) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_E,E1,E3 9:75MHz: 81 (21 * 4) Cycles Used ",
                        79);
            tdm_freq_index=9;
            expected_tdm_cycles_min=81;
            expected_tdm_cycles_max=81;
        } else if (total_tdm_slots == 16) {
            /*TDM_EA 10:75MHz: 16 (4 * 4) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_EA 10:75MHz: 16 (4 * 4) Cycles Used ",
                        79);
            tdm_freq_index=10;
            expected_tdm_cycles_min=16;
            expected_tdm_cycles_max=16;
        } else {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                      "Unsupported tdm slots:%d\n"),
                      total_tdm_slots));
            return SOC_E_FAIL;
        }
        break;
    default:
        LOG_ERROR(BSL_LS_SOC_COMMON,
                  (BSL_META_U(unit,
                              "Unsupported tdm frequency:%d\n"),
                   tdm_freq));
        return SOC_E_FAIL;
    }
    LOG_VERBOSE(BSL_LS_SOC_COMMON,
             (BSL_META_U(unit,
             "\nINFO: BaseTdmStr:%s :Index %d:MinCycles%d:MaxCycle%d\n"),
             base_tdm_str, 
             tdm_freq_index, expected_tdm_cycles_min, expected_tdm_cycles_max));
   if (!((total_tdm_slots >= expected_tdm_cycles_min) && 
         (total_tdm_slots <= expected_tdm_cycles_max))) {
          LOG_ERROR(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "Unsupported tdm cycles:%d (min:%d max:%d\n"),
                     total_tdm_slots,
                     expected_tdm_cycles_min,expected_tdm_cycles_max));
          return SOC_E_FAIL; 
   }

    idle_flag=0;
    idle_rule = 0;
    /* Initialize list */
    for (port=0;port < ML_MAX_LOGICAL_PORTS ; port++) {
         ml_tdm_port_slots_info[port].prev=&ml_tdm_port_slots_info[port];
         ml_tdm_port_slots_info[port].next=&ml_tdm_port_slots_info[port];
         ml_tdm_port_slots_info[port].position = -1;
    }
    for (index=0; index < total_tdm_slots; index++) {
         if ((tdm[index] == ML_IDLE1) ||
             (tdm[index] == ML_IDLE)) {
             if (tdm[index] == ML_IDLE) {
                 if (idle_flag == 1) {
                     idle_rule = 1;
                 }
                 idle_flag=1;
             }
             skip_count++;
             continue;
         }
         if (((index - 1) != 0) && (index != total_tdm_slots - 1) && 
             (idle_flag == 1) && (idle_rule == 0)) {
              LOG_ERROR(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                          "### Internal Error: TDM Verification failed \n"
                          "### Two consecutive idle not found at position:%d\n"
                          "### TCAM Atomicity might get affected.\n"),
                          index - 1));
             *offender_port = ML_IDLE;
             return SOC_E_CONFIG;
         }
         idle_flag=0;
         port = tdm[index];
         if (ml_tdm_port_slots_info[port].position == -1) {
             /* First Entry */
             ml_tdm_port_slots_info[port].position = index;
             skip_count++;
             continue;
         }
         head = current = &ml_tdm_port_slots_info[port];
         while(current->next !=head) {
               current = current->next;
         } 
         current->next=sal_alloc(sizeof(tdm_port_slots_info_t),"TDM Pointer");
         count++;
         LOG_VERBOSE(BSL_LS_SOC_COMMON,
                     (BSL_META_U(unit,
                                 "Count=%d SkipCount:%d  Port:%d  Addr:%p\n"),
                      count,skip_count,port,(void *)current->next));

         current->next->position=index;
         current->next->prev=current;
         current->next->next=head;
         head->prev=current->next;
   }
   if (idle_rule == 0) {
       /* Special case */
       if (!((tdm[0] == ML_IDLE) &&
             (tdm[total_tdm_slots-1] == ML_IDLE))) {
              LOG_ERROR(BSL_LS_SOC_COMMON,
                       (BSL_META_U(unit,
                       "### Internal Error: TDM Verification failed \n"
                       "### Two consecutive idle not found at Edges \n"
                       "### TCAM Atomicity might get affected.\n")));
           *offender_port = ML_IDLE1;
           return SOC_E_CONFIG;
       }
   }
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Final Count=%d SkipCount:%d\n"),count,skip_count));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying rule  \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule3: Loopback (LPBK) ports require min 3 cycle spacing "
                           "among LPBK or CMIC ports \n")));
   if (ml_tdm_port_slots_info[ML_LPBK].position == -1) {
       LOG_CLI((BSL_META_U(unit,
                           "Loopback port  missing in configuration \n")));
       return SOC_E_FAIL;
   }
   if (ml_tdm_port_slots_info[ML_CMIC].position == -1) {
       LOG_CLI((BSL_META_U(unit,
                           "CMIC port  missing in configuration \n")));
       return SOC_E_FAIL;
   }
   head = current = &ml_tdm_port_slots_info[ML_LPBK];
   do {
      prev = current->prev;
      if ( current->position != prev->position ) {
           prev_tdm_slot_spacing = 
                          (current->position - prev->position) > 0 ?
                          (current->position - prev->position)-1:
                          (total_tdm_slots - prev->position + 
                           current->position) - 1;
           next_tdm_slot_spacing = 
                          (current->next->position - current->position) >0 ?
                          (current->next->position - current->position)-1:
                          (total_tdm_slots - current->position +
                           current->next->position) - 1;
      if (prev_tdm_slot_spacing < 3) {
          LOG_ERROR(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "Loopback Ports need min 3 spacing but(prev)found"
                                "(current:%d , prev:%d)=%d\n"),
                     current->position,prev->position,prev_tdm_slot_spacing));
          rv = SOC_E_FAIL;
          continue;
      } 
      if (next_tdm_slot_spacing < 3) {
          LOG_ERROR(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "Loopback Ports need min 3 spacing but(next)found"
                                "(current:%d , prev:%d)=%d\n"),
                     current->position,prev->position,next_tdm_slot_spacing));
          rv = SOC_E_CONFIG;
          *offender_port = ML_LPBK;
          continue;
      } 
      } else {
          prev_tdm_slot_spacing = next_tdm_slot_spacing = 0;
      }
#if 0
      head1 = current1 = &ml_tdm_port_slots_info[ML_CMIC];
      do {
         tdm_slot_spacing = (current->position - current1->position) > 0 ?
                          (current->position - current1->position)-1:
                          (total_tdm_slots - current1->position + 
                           current->position) - 1  ;
         if (tdm_slot_spacing < 3) {
             LOG_ERROR(BSL_LS_SOC_COMMON,
                       (BSL_META_U(unit,
                                   "Loopback and CMIC ports need min 3 spacing but "
                                   "found:%u" "(Loopack current:%d , CMIC Current:%d)\n"),
                        tdm_slot_spacing,
                        current->position,current1->position));
             rv = SOC_E_CONFIG;
             *offender_port=ML_LPBK;
             continue;
         }
         current1 = current1->next;
      }while ((current1 !=head1) && (rv == SOC_E_NONE));
#endif
      current = current->next;
   } while ((current !=head) && (rv == SOC_E_NONE));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying rules \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule1 : Each Loopback port need 2.5G bandwidth \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule2 : Each CMIC port need 2G bandwidth       \n")));
   for (index=0;index < ML_MAX_LOGICAL_PORTS && rv == SOC_E_NONE ;index++ ) {
        port = index ;
        if (ml_tdm_port_slots_info[port].position == -1) {
            continue;
        }
        LOG_VERBOSE(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                " %d ==>\n\n"),port));
        switch(port) {
        case ML_CMIC:
            LOG_VERBOSE(BSL_LS_SOC_COMMON,
                        (BSL_META_U(unit,
                                    "CMIM \n")));
            speed =2000; 
            break;
        case ML_LPBK:
            LOG_VERBOSE(BSL_LS_SOC_COMMON,
                        (BSL_META_U(unit,
                                    "LOOPBAKC \n")));
            speed =lpbk_port_speed; 
            break;
        default:
            LOG_VERBOSE(BSL_LS_SOC_COMMON,
                        (BSL_META_U(unit,
                                    " Port:%d Speed %d ==>\n\n"),
                         port,port_speed[port-1]));
            speed = port_speed[port-1];
            break;
        }
        if ((speed == 0) && (!SOC_PBMP_MEMBER((PBMP_ALL(unit)), port))) {
            /* Eagle ports are not removed from TDM calendar 
             * Eventhough not active after lane op. Ignore those
             */
             continue;
        }

        switch(speed) {
        case 1000:
            speed_index=0;
            break;
        case 2000:
            speed_index=1;
            break;
        case 2500:
            speed_index=2;
            break;
        case 10000:
        case 10500: /* Might need ut fir HG11 */
        case 11000: /* Might need ut fir HG11 */
            speed_index=3;
            break;
        case 12500: /* Special case for LPBK port */
        case 13000:
            speed_index=4;
            break;
        case 20000:
            speed_index=5;
            break;
        case 21000:
            speed_index=6;
            break;
        default:
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                                  "Unsupported speed:%d \n"),speed));
            return SOC_E_FAIL;
        }
        worse_tdm_slot_spacing=ml_tdm_cycles_info[tdm_freq_index][speed_index].
                               worse_tdm_slot_spacing;
        min_tdm_cycles=ml_tdm_cycles_info[tdm_freq_index][speed_index].
                       min_tdm_cycles;

        count=0;
        head = current = &ml_tdm_port_slots_info[port];
        do {
           prev = current->prev;
           if (current->position != prev->position ) {
               prev_tdm_slot_spacing = 
                          (current->position - prev->position)> 0 ?
                          (current->position - prev->position)-1:
                          (total_tdm_slots - prev->position + 
                           current->position) - 1  ;
               next_tdm_slot_spacing = 
                          (current->next->position - current->position) > 0 ?
                          (current->next->position - current->position)-1:
                          (total_tdm_slots - current->position + 
                           current->next->position) - 1;
           } else {
               prev_tdm_slot_spacing = next_tdm_slot_spacing = 0;
           }
           LOG_VERBOSE(BSL_LS_SOC_COMMON,
                       (BSL_META_U(unit,
                                   "Pos:%d Spacing (Prev %d - %d =  )%d"
                                   "(Next %d - %d =  )%d\n"), current->position,
                        current->position , prev->position ,
                        prev_tdm_slot_spacing, current->next->position , 
                        current->position , next_tdm_slot_spacing));
           if ((prev_tdm_slot_spacing > worse_tdm_slot_spacing) ||
               (next_tdm_slot_spacing > worse_tdm_slot_spacing)) {
                if (port == ML_CMIC) {
                    /* Exception for worst TDM slot spacing for CMIC port */
                    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                              (BSL_META_U(unit,
                               "WorseSpacing:%d (prev:%d next:%d)"
                               "NOK !!!! port:%d\n"),
                                worse_tdm_slot_spacing,
                                prev_tdm_slot_spacing, next_tdm_slot_spacing,
                               port));
                    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                              (BSL_META_U(unit,"**ATTN:SKIPPING FOR TIME-BEING \n")));
                } else {
                    LOG_ERROR(BSL_LS_SOC_COMMON,
                              (BSL_META_U(unit,
                               "WorseSpacing:%d (prev:%d next:%d)"
                               "NOK !!!! port:%d\n"),
                                worse_tdm_slot_spacing,
                                prev_tdm_slot_spacing, next_tdm_slot_spacing,
                               port));
                    rv = SOC_E_CONFIG;
                    *offender_port=port;
                    continue;
                } 
           }
           count++;
           current = current->next;
        } while ((current !=head) && (rv == SOC_E_NONE)) ;
        LOG_VERBOSE(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "TDM Cycles: %d \n"),count));
        if (count < min_tdm_cycles) {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                                  "min_tdm_cycles:%dNOK  !!!! port:%d\n"),
                       min_tdm_cycles,port));
            rv =  SOC_E_CONFIG;
            *offender_port=port;
            continue;
        }
        LOG_VERBOSE(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "n== %d <==\n\n"),port));
   }

   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying rule  \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule4 : Each subport in MXQPORT operates with 4 cycle TDM \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying MXQports spacing concern\n")));
   for(mxqblock=0;mxqblock<(ML_MAX_BLOCKS-1) && rv == SOC_E_NONE ;mxqblock++) {
       for(index=0;
           index<ML_MAX_PORTS_PER_BLOCK && rv == SOC_E_NONE;
           index++) {
           outer_port = (*ml_block_ports[unit])[mxqblock][index];
           if (outer_port == 0xFF) {
               if ((mxqblock == 7)  && (index == 3)) {
                    outer_port = 40;
               } else {
                   continue;
               }
           }
           if (ml_tdm_port_slots_info[outer_port].position == -1) {
               continue;
           }
           head = current = &ml_tdm_port_slots_info[outer_port];
           do {
              for(loop=0;loop<ML_MAX_PORTS_PER_BLOCK; loop++) {
                  inner_port=(*ml_block_ports[unit])[mxqblock][loop];
                  if (inner_port == 0xFF) {
                      if ((mxqblock == 7)  && (loop == 3)) {
                           inner_port = 40;
                      } else {
                          continue;
                      }
                  }
                  if ( inner_port == outer_port) {
                       continue;
                  }
                  if (ml_tdm_port_slots_info[inner_port].position == -1) {
                      continue;
                  }
                  head1 = current1 = &ml_tdm_port_slots_info[inner_port];
                  do {
                       spacing = (current->position - current1->position) > 0 ?
                                 (current->position - current1->position)-1:
                                 (total_tdm_slots - current1->position +
                                  current->position) - 1;
                       if (spacing < 3) {
                           LOG_ERROR(BSL_LS_SOC_COMMON,
                                     (BSL_META_U(unit,
                                                 "Outer Port:%d Inner Port:%d "
                                                 "MXQSpacing Issue"
                                                 "Expected > 4 but observed %d\n"),
                                      outer_port,inner_port,spacing));
                           rv = SOC_E_CONFIG;
                           *offender_port=outer_port;
                           continue;
                       }
                       current1 = current1->next;
                  } while ((current1 !=head1) && (rv == SOC_E_NONE));
              }
              current = current->next;
         } while ((current !=head) && (rv == SOC_E_NONE));
      }
  }

  /* Free allocated resources */
  count=0;
  for (port=0;port < ML_MAX_LOGICAL_PORTS ; port++) {
       head = current = &ml_tdm_port_slots_info[port];
       do {
          temp = current->next;
          if (current != head) {
              count++;
              LOG_VERBOSE(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                                      "Freed count :%d\n"),count));
              sal_free(current);
          }          
          current = temp;
       } while (current != head);
       ml_tdm_port_slots_info[port].prev=NULL;
       ml_tdm_port_slots_info[port].next=NULL;
       ml_tdm_port_slots_info[port].position = -1;
  }
  sal_memcpy(&ml_current_tdm_cycles_info,
             &ml_tdm_cycles_info[tdm_freq_index][0],
             sizeof(tdm_cycles_info_t)*KT2_MAX_SPEEDS);
  return rv;
    return SOC_E_NONE;
}
#endif

#ifdef BCM_WARM_BOOT_SUPPORT

uint32  *iarb_tdm_ml[SOC_MAX_NUM_DEVICES];

int soc_ml_retrieve_hw_tdm(int unit)
{
    uint32                  rval = 0;
    uint8                   tdm_no = 0;
    soc_mem_t               tdm_table[]={IARB_TDM_TABLEm , IARB_TDM_TABLE_1m};
    iarb_tdm_table_entry_t  iarb_tdm_entry;
    uint32                  num_iarb_entry = 0, iarb_size=0;
    int                     index = 0;

    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    tdm_no = soc_reg_field_get(unit, IARB_TDM_CONTROLr, rval, SELECT_TDMf);

    /* Allocate memory for TDM. Get size from IARB table. */
    num_iarb_entry = soc_mem_index_count(unit,IARB_TDM_TABLEm);
    iarb_size =  num_iarb_entry * sizeof(iarb_tdm_table_entry_t);

    if(iarb_tdm_ml[unit] != NULL) {
        sal_free(iarb_tdm_ml[unit]);
        iarb_tdm_ml[unit] = NULL;
    }
    iarb_tdm_ml[unit] = sal_alloc(iarb_size, "iarb_tdm_ml");
    if (iarb_tdm_ml[unit] == NULL) {
        return SOC_E_MEMORY;
    }
    sal_memset(iarb_tdm_ml[unit], 0, iarb_size);

    for (index = 0; index < num_iarb_entry; index++) {
        SOC_IF_ERROR_RETURN(soc_mem_read(unit, tdm_table[tdm_no], SOC_BLOCK_ALL,
                    index, &iarb_tdm_entry));
        iarb_tdm_ml[unit][index] = soc_mem_field32_get(unit, tdm_table[tdm_no],
                &iarb_tdm_entry, PORT_NUMf);
    }
    return SOC_E_NONE;
}


/* Functions related to flexio scache */
int _soc_ml_flexio_scache_allocate(int unit)
{
    int                 rv=SOC_E_NONE;
    uint8               *flexio_scache_ptr;
    soc_scache_handle_t scache_handle;
    uint32              alloc_get=0;
    uint32 alloc_size =  sizeof(scache_begin_magic_number) +
                         sizeof(ml_scache_tdm_info) +
                         sizeof(ml_scache_tdm) +
                         sizeof(ml_scache_speed) +
                         sizeof(ml_port_speeds_scache) +
                         sizeof(ml_scache_port_details) +
                         sizeof(scache_end_magic_number);

    SOC_SCACHE_HANDLE_SET(scache_handle, unit, SOC_SCACHE_FLEXIO_HANDLE,
            BCM_FLEXIO_SCACHE_DEFAULT_PARTITION);

    rv = soc_scache_alloc(unit, scache_handle, alloc_size);
    if (rv  == SOC_E_CONFIG) {
        /* Probably Level1 */
        return SOC_E_NONE;
    }

    /* NotRequired but just to confirm Get the pointer for the Level 2 cache */
    SOC_IF_ERROR_RETURN(soc_scache_ptr_get(unit, scache_handle,
                        &flexio_scache_ptr, &alloc_get));

    if (alloc_get != alloc_size) {
        /* Expected size doesn't match retrieved size */
        return SOC_E_INTERNAL;
    }
    if (NULL == flexio_scache_ptr) {
        return SOC_E_MEMORY;
    }

    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                (BSL_META_U(unit,
                        "%s()[LINE:%d] DONE \n"),FUNCTION_NAME(),  __LINE__));
    return SOC_E_NONE;
}

int _soc_ml_flexio_scache_retrieve(int unit)
{
    int                 rv;
    uint8               *flexio_scache_ptr;
    soc_scache_handle_t scache_handle;
    uint32              alloc_get=0;

    uint32 alloc_size =  sizeof(ml_scache_tdm_info) +
                         sizeof(ml_scache_tdm) +
                         sizeof(ml_scache_speed) +
                         sizeof(ml_port_speeds_scache) +
                         sizeof(ml_scache_port_details) +
                         SOC_WB_SCACHE_CONTROL_SIZE;
    uint32              scache_offset=0;
    uint16              default_ver = BCM_WB_DEFAULT_VERSION;
    uint16              recovered_ver;

    SOC_SCACHE_HANDLE_SET(scache_handle, unit, SOC_SCACHE_FLEXIO_HANDLE,
            BCM_FLEXIO_SCACHE_DEFAULT_PARTITION);

    rv = soc_scache_ptr_get(unit, scache_handle,
                                &flexio_scache_ptr, &alloc_get);
    if (rv == SOC_E_NOT_FOUND) {
        /* Partition 1 is not available, fall back to old retrieve procedure*/
        SOC_IF_ERROR_RETURN(_soc_ml_flexio_scache_retrieve_part0(unit));
        return SOC_E_NONE;
    }

    if (alloc_get != (alloc_size + SOC_WB_SCACHE_CONTROL_SIZE)) {
        /* Expected size doesn't match retrieved size */
        return SOC_E_INTERNAL;
    }

    /* Partition 1 is found. So Extract sync-ed details */
    scache_offset = 0;
    sal_memcpy(&recovered_ver,
                  &flexio_scache_ptr[scache_offset], sizeof(uint16));

    if( default_ver > recovered_ver ) {
       LOG_VERBOSE(BSL_LS_SOC_COMMON,
                   (BSL_META_U(unit, "Scache Upgraded.\n")));
    }

    scache_offset += SOC_WB_SCACHE_CONTROL_SIZE;
    sal_memcpy(&ml_scache_tdm_info,
               &flexio_scache_ptr[scache_offset], sizeof(ml_scache_tdm_info));

    bcm56270_tdm_info[COUNTOF(bcm56270_tdm_info)-1] = ml_scache_tdm_info;

    scache_offset += sizeof(ml_scache_tdm_info);
    sal_memcpy(&ml_scache_tdm,
               &flexio_scache_ptr[scache_offset], sizeof(ml_scache_tdm));

    scache_offset += sizeof(ml_scache_tdm);
    sal_memcpy(&ml_scache_speed,
               &flexio_scache_ptr[scache_offset], sizeof(ml_scache_speed));

    scache_offset += sizeof(ml_scache_speed);

    sal_memcpy(&ml_port_speeds_scache,
               &flexio_scache_ptr[scache_offset], sizeof(ml_port_speeds_scache));

    scache_offset += sizeof(ml_port_speeds_scache);

    sal_memcpy(&ml_scache_port_details,
               &flexio_scache_ptr[scache_offset],
               sizeof(ml_scache_port_details));
    scache_offset += sizeof(ml_scache_port_details);

    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                (BSL_META_U(unit,
                            "%s()[LINE:%d] \n"),FUNCTION_NAME(),  __LINE__));
    return SOC_E_NONE;
}


int _soc_ml_flexio_scache_retrieve_part0(int unit)
{
    int                 rv;
    uint8               *flexio_scache_ptr;
    soc_scache_handle_t scache_handle;
    uint32              alloc_get=0;
    uint32 alloc_size =  sizeof(scache_begin_magic_number) +
                         sizeof(ml_scache_tdm_info) +
                         sizeof(ml_scache_tdm) +
                         sizeof(ml_scache_speed) +
                         sizeof(ml_port_speeds_scache) +
                         sizeof(ml_scache_port_details) +
                         sizeof(scache_end_magic_number);
    uint32              scache_offset=0;

    SOC_SCACHE_HANDLE_SET(scache_handle, unit, SOC_SCACHE_FLEXIO_HANDLE, 0);

    /* NotRequired but just to confirm Get the pointer for the Level 2 cache */
    rv = soc_scache_ptr_get(unit, scache_handle,
                            &flexio_scache_ptr, &alloc_get);
    if (rv == SOC_E_NOT_FOUND) {
        /* Probably Level1 */
        return SOC_E_NONE;
    }

    if (alloc_get != (alloc_size + SOC_WB_SCACHE_CONTROL_SIZE)) {
        /* Expected size doesn't match retrieved size */
        return SOC_E_INTERNAL;
    }

    if (NULL == flexio_scache_ptr) {
        return SOC_E_MEMORY;
    }

    scache_offset = 0;
    if(sal_memcmp(&flexio_scache_ptr[scache_offset],
                  &scache_begin_magic_number[0],
                  sizeof(scache_begin_magic_number)) != 0) {
        LOG_CLI((BSL_META_U(unit,
                            "Corrupt scache for flexio operation \n")));
       return SOC_E_INTERNAL;
    }

    scache_offset += sizeof(scache_begin_magic_number);
    sal_memcpy(&ml_scache_tdm_info,
               &flexio_scache_ptr[scache_offset], sizeof(ml_scache_tdm_info));

    bcm56270_tdm_info[COUNTOF(bcm56270_tdm_info)-1] = ml_scache_tdm_info;

    scache_offset += sizeof(ml_scache_tdm_info);

    /*
     * Part 0 Version has an issue in TDM sync.
     * So in part 0 version, Level 1 recovery performed to retrieve TDM.
     */
    LOG_INFO(BSL_LS_SOC_COMMON,
            (BSL_META_U(unit,
                        "Previous ver was synced with incorrect TDM,"
                        "Now LEVEL 1 recovery for TDM\n")));

    SOC_IF_ERROR_RETURN(soc_ml_retrieve_hw_tdm(unit));
    if(iarb_tdm_ml[unit] == NULL) {
        return SOC_E_INTERNAL;
    }

    sal_memcpy(&ml_scache_tdm, iarb_tdm_ml[unit], sizeof(ml_scache_tdm));

    kt2_tdm_display(unit, (uint32 *) (&ml_scache_tdm[0]),
            ml_scache_tdm_info.tdm_size,
            ml_scache_tdm_info.row,
            ml_scache_tdm_info.col);

    scache_offset += sizeof(ml_scache_tdm);
    sal_memcpy(&ml_scache_speed,
               &flexio_scache_ptr[scache_offset], sizeof(ml_scache_speed));

    scache_offset += sizeof(ml_scache_speed);

    sal_memcpy(&ml_port_speeds_scache,
               &flexio_scache_ptr[scache_offset], sizeof(ml_port_speeds_scache));

    scache_offset += sizeof(ml_port_speeds_scache);

    sal_memcpy(&ml_scache_port_details,
               &flexio_scache_ptr[scache_offset],
               sizeof(ml_scache_port_details));
    scache_offset += sizeof(ml_scache_port_details);

    if (sal_memcmp(&flexio_scache_ptr[scache_offset],
                   &scache_end_magic_number[0],
                   sizeof(scache_end_magic_number)) != 0) {
        LOG_CLI((BSL_META_U(unit,
                            "Corrupt scache for flexio operation \n")));
        return SOC_E_INTERNAL;
    }

    /* Allocate SCACHE at part 1 Now */
    SOC_IF_ERROR_RETURN(_soc_ml_flexio_scache_allocate(unit));

    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                (BSL_META_U(unit,
                            "%s()[LINE:%d] \n"),FUNCTION_NAME(),  __LINE__));

    return SOC_E_NONE;
}

int _soc_ml_flexio_scache_sync(int unit)
{
    int                 rv;
    uint8               *flexio_scache_ptr;
    soc_scache_handle_t scache_handle;
    uint32              alloc_get=0;
    uint32 alloc_size =  sizeof(ml_scache_tdm_info) +
                         sizeof(ml_scache_tdm) +
                         sizeof(ml_scache_speed) +
                         sizeof(ml_port_speeds_scache) +
                         sizeof(ml_scache_port_details) +
                         SOC_WB_SCACHE_CONTROL_SIZE;
    uint32              scache_offset=0;
    int                 cfg_num=0;
    uint32              port=0;
    uint16              default_ver = BCM_WB_DEFAULT_VERSION;

    SOC_SCACHE_HANDLE_SET(scache_handle, unit, SOC_SCACHE_FLEXIO_HANDLE,
            BCM_FLEXIO_SCACHE_DEFAULT_PARTITION);

    /* NotRequired but just to confirm Get the pointer for the Level 2 cache */
    rv = soc_scache_ptr_get(unit, scache_handle,
                            &flexio_scache_ptr, &alloc_get);
    if (rv == SOC_E_NOT_FOUND) {
        /* Probably Level1 */
        return SOC_E_NONE;
    }
    if (alloc_get != (alloc_size + SOC_WB_SCACHE_CONTROL_SIZE)) {
        /* Expected size doesn't match retrieved size */
        return SOC_E_INTERNAL;
    }
    if (NULL == flexio_scache_ptr) {
        return SOC_E_MEMORY;
    }

    SOC_IF_ERROR_RETURN(_soc_metrolite_get_cfg_num(unit, 0, &cfg_num));

    scache_offset = 0;
    sal_memcpy(&flexio_scache_ptr[scache_offset],
               &default_ver, sizeof(uint16));

    scache_offset += SOC_WB_SCACHE_CONTROL_SIZE;
    sal_memcpy(&flexio_scache_ptr[scache_offset],
               &bcm56270_tdm_info[cfg_num],
               sizeof(ml_scache_tdm_info));

    scache_offset += sizeof(ml_scache_tdm_info);
    sal_memcpy(&flexio_scache_ptr[scache_offset],
               &ml_current_tdm[0],
               sizeof(uint32)* bcm56270_tdm_info[cfg_num].tdm_size);

    scache_offset += sizeof(ml_scache_tdm);

    for (port=1 ; port <= ML_MAX_PHYSICAL_PORTS ; port++) {
         ml_scache_speed[port-1] = 0;
         /* mxqblock = (*kt2_port_to_mxqblock[unit])[port-1]; */
         ml_scache_port_details[port-1].start_port_no = port;
         ml_scache_port_details[port-1].end_port_no = port;
         ml_scache_port_details[port-1].port_incr = 1;
         ml_scache_port_details[port-1].port_type = 0;
         ml_scache_port_details[port-1].port_speed = 0xFFFF;

         if (IS_MXQ_PORT(unit,port)) {
             if ((bcm56270_speed[unit][cfg_num][port-1] == 0) || /*Converted */
                 (bcm56270_speed[unit][cfg_num][port-1] >= 2500)) {
                  ml_scache_speed[port - 1] = 2500;
                  ml_scache_port_details[port-1].port_speed = 2500;
             } else {
                  ml_scache_speed[port - 1] = 1000;
                  ml_scache_port_details[port-1].port_speed = 1000;
             }
             ml_scache_port_details[port-1].port_type = GE_PORT;
         }

         if (IS_XE_PORT(unit,port)) {
             ml_scache_speed[port - 1] = 10000;
             ml_scache_port_details[port-1].port_speed = 10000;
             ml_scache_port_details[port-1].port_type |= XE_PORT;
             if (IS_MXQ_PORT(unit,port)) {
                 ml_scache_port_details[port-1].port_incr = 4;
             }
         }

         if (IS_HG_PORT(unit,port)) {
             ml_scache_speed[port - 1] = 10000;
             ml_scache_port_details[port-1].port_speed = 10000;
             ml_scache_port_details[port-1].port_type |= HG_PORT;
             ml_scache_port_details[port-1].port_type |= STK_PORT;
         }

        if (IS_XL_PORT(unit, port) && (IS_GE_PORT(unit, port))) {
            if (bcm56270_speed[unit][cfg_num][port-1] >= 2500) {
                ml_scache_speed[port - 1] = 2500;
                ml_scache_port_details[port-1].port_speed = 2500;
            } else {
                ml_scache_speed[port - 1] = 1000;
                ml_scache_port_details[port-1].port_speed = 1000;
            }
            ml_scache_port_details[port-1].port_type |= GE_PORT;
        }
    }

    sal_memcpy(&flexio_scache_ptr[scache_offset],
               &ml_scache_speed, sizeof(ml_scache_speed));
    scache_offset += sizeof(ml_scache_speed);

    sal_memcpy(&flexio_scache_ptr[scache_offset],
               ml_port_speeds_s[cfg_num], sizeof(ml_port_speeds_scache));
    scache_offset += sizeof(ml_port_speeds_scache);

    sal_memcpy(&flexio_scache_ptr[scache_offset],
               &ml_scache_port_details,
               sizeof(ml_scache_port_details));
    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                (BSL_META_U(unit,
                            "%s()[LINE:%d] \n"),FUNCTION_NAME(),  __LINE__));
    return SOC_E_NONE;
}
#endif /* end of BCM_WARM_BOOT_SUPPORT */

void soc_metrolite_save_tdm_pos(int unit, uint32 new_tdm_size,uint32 *new_tdm) {
    uint32 pos=0;
    uint8 port=0;
    uint8 block=0;
    uint8 total_slots=0;
    
    sal_memset(ml_tdm_pos_info,0,sizeof(ml_tdm_pos_info));
    for (pos = 0; pos < new_tdm_size ; pos++) {
         port= new_tdm[pos];
         if ((port == ML_IDLE) || (port == ML_LPBK) || 
             (port == ML_CMIC)) {
              continue;
         }
         if(port > ML_MAX_PHYSICAL_PORTS ) {
             LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                             "tdm_size %d, pos %d, port %d \n"),
                               new_tdm_size, pos, port));

         } else {
             block = (*ml_port_to_block[unit])[port - 1];
             total_slots = ml_tdm_pos_info[block].total_slots;
             ml_tdm_pos_info[block].pos[total_slots]=pos;
             ml_tdm_pos_info[block].total_slots++;
         }
    }

    sal_memcpy(ml_current_tdm,new_tdm,new_tdm_size*sizeof(new_tdm[0]));
    ml_current_tdm_size=new_tdm_size;

}

/* This function splits the occurance of first port of the block into 4 ports */
/* Make sure that the tdm of the block is not already split */
void ml_block_tdm_split(int unit, uint32 *tdm,
        uint32 total_tdm_slots, uint32 block)
{
     uint32 index=0, count=0;
     uint32 first_port;

     first_port = (*ml_block_ports[unit])[block][0];
     for (index=0; index < total_tdm_slots ; index++ ) {
         /* Split first port occurance in to 4 */
          if (tdm[index] == first_port) {
              tdm[index] = first_port + (count % 4);
              count++;
          }

     }
}

void ml_tdm_replace(uint32 *tdm, uint32 total_tdm_slots,
                     uint32  src, uint32 dst,uint32 one_time)
{
     uint32 index=0;
     for (index=0; index < total_tdm_slots ; index++ ) {
          if (tdm[index] == src) {
              tdm[index] = dst;
              if (one_time) {
                  break;
              }
          }
     }
}

void ml_tdm_swap(uint32 *tdm, uint32 total_tdm_slots,
                  uint32  src, uint32 dst)
{
     uint32 index=0;
     uint32 temp_index=0;
     uint32 temp=0;
     for (index=0; index < total_tdm_slots ; index++ ) {
          if (tdm[index] == src) {
              temp_index=index;
          }
          if (tdm[index] == dst) {
              temp = tdm[temp_index];
              tdm[temp_index]=dst;
              tdm[index]=temp;
          }
     }
}

soc_error_t
soc_metrolite_reconfigure_tdm(int unit,uint32 new_tdm_size,uint32 *new_tdm)
{
    uint8                   new_tdm_no=0;
    soc_mem_t               tdm_table[]={IARB_TDM_TABLEm , IARB_TDM_TABLE_1m};
    soc_field_t             wrap_ptr[]={TDM_WRAP_PTRf , TDM_1_WRAP_PTRf};
    uint32                  lls_tdm_size=0;
    lls_port_tdm_entry_t    *lls_tdm=NULL;
    uint32                  iarb_size=0;
    iarb_tdm_table_entry_t  *iarb_tdm=NULL;
    int                     iter=0;
    uint32                  index;
    uint32                  rval;
    int                     cfg_num;

    SOC_IF_ERROR_RETURN(_soc_metrolite_get_cfg_num(unit, 0, &cfg_num));
    if (cfg_num >= (sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))) {
        return SOC_E_FAIL;
    } 
    
    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    old_tdm_no = soc_reg_field_get(unit, IARB_TDM_CONTROLr, rval, SELECT_TDMf);
    new_tdm_no = (old_tdm_no + 1)%2;

    iarb_size =  soc_mem_index_count(unit,IARB_TDM_TABLEm) *
                 sizeof(iarb_tdm_table_entry_t);
    iarb_tdm = soc_cm_salloc(unit,iarb_size, "iarb_tdm_table_entry_t");
    if (iarb_tdm == NULL) {
        return SOC_E_MEMORY;
    }            
    sal_memset(iarb_tdm,0,iarb_size);

    lls_tdm_size =  soc_mem_index_count(unit,LLS_PORT_TDMm) *
                    sizeof(lls_port_tdm_entry_t);
    lls_tdm = soc_cm_salloc(unit,lls_tdm_size, "lls_port_tdm_entry_t");
    if (lls_tdm == NULL) {
        soc_cm_sfree(unit,iarb_tdm);
        return SOC_E_MEMORY;
    }
    sal_memset(lls_tdm,0,lls_tdm_size);

    for (index = 0; index < new_tdm_size; index++) {
        soc_IARB_TDM_TABLEm_field32_set(unit, &iarb_tdm[index], PORT_NUMf,
                                        new_tdm[index]);
    }   
    soc_mem_write_range(unit, tdm_table[new_tdm_no], MEM_BLOCK_ALL, 0,
                        new_tdm_size, iarb_tdm);
    soc_cm_sfree(unit,iarb_tdm);        

    for (index = 0; index < new_tdm_size/2; index++) {
         soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                       PORT_ID_0f, new_tdm[index*2]);
         if ( new_tdm[index*2] < ML_IDLE ) {
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_0_ENABLEf, 1);
         } else {
              LOG_VERBOSE(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                                      "IDLE SLOTs so PORT_ID_0_ENABLEf=0 \
                                       for index=%d\n"), index));
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_0_ENABLEf, 0);
         }

         soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                       PORT_ID_1f, new_tdm[(index*2) + 1]);
         if ( new_tdm[(index*2)+1] < ML_IDLE ) {
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_1_ENABLEf, 1);
         } else {
              LOG_VERBOSE(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                                      "IDLE SLOTs so PORT_ID_1_ENABLEf=0 \
                                       for index=%d\n"), index));
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_1_ENABLEf, 0);
         } 
    } /* for index */

    if (new_tdm_size % 2) {
        LOG_CLI((BSL_META_U(unit,           
                            "ODD TDM SIZE \n")));
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index*2],
                                      PORT_ID_0_ENABLEf, 1);
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index*2],
                                      PORT_ID_0f, new_tdm[(index*2)]);
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[(index*2)+1],
                                      PORT_ID_1_ENABLEf, 0);
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[(index*2)+1],
                                      PORT_ID_1f, 0);
        index++;
    }

    soc_mem_write_range(unit, LLS_PORT_TDMm, MEM_BLOCK_ALL,
                        new_tdm_no*256, (new_tdm_no*256) + index,
                        lls_tdm);
    soc_cm_sfree(unit,lls_tdm);

    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, DISABLEf, 0);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, 
                      wrap_ptr[new_tdm_no],new_tdm_size -1);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, SELECT_TDMf, new_tdm_no);
    SOC_IF_ERROR_RETURN(WRITE_IARB_TDM_CONTROLr(unit, rval));

    if (bsl_check(bslLayerSoc, bslSourceCommon, bslSeverityVerbose, unit)) {
        kt2_tdm_display(unit,new_tdm,new_tdm_size,
                        bcm56270_tdm_info[cfg_num].row,
                        bcm56270_tdm_info[cfg_num].col);
    }

    SOC_IF_ERROR_RETURN(WRITE_LLS_TDM_CAL_CFG_SWITCHr(unit, 1));
    if ((SAL_BOOT_BCMSIM || SAL_BOOT_PLISIM)) {
        SOC_IF_ERROR_RETURN(READ_LLS_TDM_CAL_CFGr(unit, &rval));
        soc_reg_field_set(unit, LLS_TDM_CAL_CFGr, &rval,
                          CURRENT_CALENDARf,new_tdm_no);
        SOC_IF_ERROR_RETURN(WRITE_LLS_TDM_CAL_CFGr(unit, rval));
    }

    do {
        SOC_IF_ERROR_RETURN(READ_LLS_TDM_CAL_CFGr(unit, &rval));
        sal_udelay(100);
        if (soc_reg_field_get(unit, LLS_TDM_CAL_CFGr, rval,
                              CURRENT_CALENDARf) == new_tdm_no) {
            break;
        }
    } while (iter++ < 100000);

    if (iter >= 100000) {
        LOG_ERROR(BSL_LS_SOC_COMMON,
                  (BSL_META_U(unit, "LLS Calendar switch failed !!\n")));
        return SOC_E_INTERNAL;
    }

    old_tdm_no = new_tdm_no;
    soc_metrolite_save_tdm_pos(unit, new_tdm_size,new_tdm);

    return SOC_E_NONE;
}
#if 0
soc_error_t ml_tdm_verify(int unit,
                           uint32 *tdm,
                           uint32 total_tdm_slots,
                           uint32 tdm_freq,    /* In MHHz */
                           uint32 *port_speed,
                           uint32 lpbk_port_speed,
                           uint32 *offender_port) 
{
    /* Following rules need to be met */
    /* Rule1 : Each Loopback port need 2.5G bandwidth */
    /* Rule2 : Each CMIC port need 2G bandwidth       */
    /* Rule3 : Loopback (LPBK) ports require min 3 cycle spacing among LPBK or 
               CMIC ports */ 
    /* Rule4 : Each subport in MXQPORT operates with 4 cycle TDM */
    /* Rule5 : Each 10G-XAUI ports should be able to operate in 4x2.5G with 4 
               slots allocated to each subport from the same MXQPORT */
    soc_error_t           rv=SOC_E_NONE;
    uint32                index=0;
    uint32                expected_tdm_cycles_min=0;
    uint32                expected_tdm_cycles_max=0;
    uint32                tdm_freq_index=0;
    uint32                speed_index=0;
    uint32                port=0;
    uint32                speed=0;
    uint32                worse_tdm_slot_spacing=0;
    uint32                prev_tdm_slot_spacing=0;
    uint32                next_tdm_slot_spacing=0;
#if 0
    uint32                tdm_slot_spacing=0;
#endif
    uint32                min_tdm_cycles=0; /* To Meet BW */
    uint32                count=0; 
    uint32                skip_count=0; 
    uint32                mxqblock=0;
    uint32                outer_port=0;
    uint32                inner_port=0;
    uint32                spacing=0;
    uint32                loop=0;
    tdm_port_slots_info_t *head=NULL;
    tdm_port_slots_info_t *head1=NULL;
    tdm_port_slots_info_t *current=NULL;
    tdm_port_slots_info_t *current1=NULL;
    tdm_port_slots_info_t *prev = NULL;
    tdm_port_slots_info_t *temp=NULL;
    uint32                idle_flag=0;
    uint32                idle_rule=0;
    char                  base_tdm_str[80];

   /* Possible TDM frequencies 
      80MHz(16Cycles) ,120MHz(20Cycles),155MHz(84Cycles),
      185MHz(80Cycles),185MHz(90Cycles) 
    */
    switch(tdm_freq) {
    case 130:
        if (total_tdm_slots == 284) {
            /*TDM_A : 0:130MHz: 284 (41 * 7) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_A : 0:130MHz: 284 (41 * 7) Cycles Used",
                        79);
            tdm_freq_index=0;
            expected_tdm_cycles_min=284;
            expected_tdm_cycles_max=284;
        } else if (total_tdm_slots == 141) {
            /*TDM_C,C1,C2: 7:130MHz: 141 (21 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_AA,TDM_C,C1,C2: 7:130MHz:141 (21 * 6) Cycles Used",
                        79);
            tdm_freq_index=7;
            expected_tdm_cycles_min=141;
            expected_tdm_cycles_max=141;
        } else if (total_tdm_slots == 168) {
            /*TDM_D: 8:130MHz: 168 (28 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_D: 8:130MHz: 168 (28 * 6) Cycles Used",
                        79);
            tdm_freq_index=8;
            expected_tdm_cycles_min=168;
            expected_tdm_cycles_max=168;
        } else {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                      "Unsupported tdm slots:%d\n"),
                      total_tdm_slots));
            return SOC_E_FAIL;
        }
        break;
    case 24:
        /*TDM_A1: 2:24MHz: 13 (4 * 4) Cycles Used */
        sal_strncpy(base_tdm_str, 
                    "TDM_A1: 2:24MHz: 13 (4 * 4) Cycles Used ",
                    79);
        tdm_freq_index=2;
        expected_tdm_cycles_min=13;
        expected_tdm_cycles_max=13;
        break;
    case 37:
        /*TDM_A1A: 3:37MHz: 84 (21 * 4) Cycles Used */
        sal_strncpy(base_tdm_str, 
                    "TDM_A1A: 3:37MHz: 84 (21 * 4) Cycles Used ",
                    79);
        tdm_freq_index=3;
        expected_tdm_cycles_min=84;
        expected_tdm_cycles_max=84;
        break;
    case 118:
        if (total_tdm_slots == 133) {
            /*TDM_B: 4:118MHz: 133 (23 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_B: 4:118MHz: 133 (23 * 6) Cycles Used ",
                        79);
            tdm_freq_index=4;
            expected_tdm_cycles_min=133;
            expected_tdm_cycles_max=133;
        } else if (total_tdm_slots == 120) {
            /*TDM_B1: 5:118MHz: 120 (20 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_B1: 5:118MHz: 120 (20 * 6) Cycles Used ",
                        79);
            tdm_freq_index=5;
            expected_tdm_cycles_min=120;
            expected_tdm_cycles_max=120;
        } else if (total_tdm_slots == 121) {
            /*TDM_B1A: 6:118MHz: 121 (21 * 6) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_B1A: 6:118MHz: 121 (21 * 6) Cycles Used ",
                        79);
            tdm_freq_index=6;
            expected_tdm_cycles_min=121;
            expected_tdm_cycles_max=121;
        } else {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                      "Unsupported tdm slots:%d\n"),
                      total_tdm_slots));
            return SOC_E_FAIL;
        }
        break;
    case 75:
        if (total_tdm_slots == 81) {
            /*TDM_E,E1,E3 9:75MHz: 81 (21 * 4) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_E,E1,E3 9:75MHz: 81 (21 * 4) Cycles Used ",
                        79);
            tdm_freq_index=9;
            expected_tdm_cycles_min=81;
            expected_tdm_cycles_max=81;
        } else if (total_tdm_slots == 16) {
            /*TDM_EA 10:75MHz: 16 (4 * 4) Cycles Used */
            sal_strncpy(base_tdm_str, 
                        "TDM_EA 10:75MHz: 16 (4 * 4) Cycles Used ",
                        79);
            tdm_freq_index=10;
            expected_tdm_cycles_min=16;
            expected_tdm_cycles_max=16;
        } else {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                      "Unsupported tdm slots:%d\n"),
                      total_tdm_slots));
            return SOC_E_FAIL;
        }
        break;
    default:
        LOG_ERROR(BSL_LS_SOC_COMMON,
                  (BSL_META_U(unit,
                              "Unsupported tdm frequency:%d\n"),
                   tdm_freq));
        return SOC_E_FAIL;
    }
    LOG_VERBOSE(BSL_LS_SOC_COMMON,
             (BSL_META_U(unit,
             "\nINFO: BaseTdmStr:%s :Index %d:MinCycles%d:MaxCycle%d\n"),
             base_tdm_str, 
             tdm_freq_index, expected_tdm_cycles_min, expected_tdm_cycles_max));
   if (!((total_tdm_slots >= expected_tdm_cycles_min) && 
         (total_tdm_slots <= expected_tdm_cycles_max))) {
          LOG_ERROR(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "Unsupported tdm cycles:%d (min:%d max:%d\n"),
                     total_tdm_slots,
                     expected_tdm_cycles_min,expected_tdm_cycles_max));
          return SOC_E_FAIL; 
   }

    idle_flag=0;
    idle_rule = 0;
    /* Initialize list */
    for (port=0;port < ML_MAX_LOGICAL_PORTS ; port++) {
         ml_tdm_port_slots_info[port].prev=&ml_tdm_port_slots_info[port];
         ml_tdm_port_slots_info[port].next=&ml_tdm_port_slots_info[port];
         ml_tdm_port_slots_info[port].position = -1;
    }
    for (index=0; index < total_tdm_slots; index++) {
         if ((tdm[index] == ML_IDLE1) ||
             (tdm[index] == ML_IDLE)) {
             if (tdm[index] == ML_IDLE) {
                 if (idle_flag == 1) {
                     idle_rule = 1;
                 }
                 idle_flag=1;
             }
             skip_count++;
             continue;
         }
         if (((index - 1) != 0) && (index != total_tdm_slots - 1) && 
             (idle_flag == 1) && (idle_rule == 0)) {
              LOG_ERROR(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                          "### Internal Error: TDM Verification failed \n"
                          "### Two consecutive idle not found at position:%d\n"
                          "### TCAM Atomicity might get affected.\n"),
                          index - 1));
             *offender_port = ML_IDLE;
             return SOC_E_CONFIG;
         }
         idle_flag=0;
         port = tdm[index];
         if (ml_tdm_port_slots_info[port].position == -1) {
             /* First Entry */
             ml_tdm_port_slots_info[port].position = index;
             skip_count++;
             continue;
         }
         head = current = &ml_tdm_port_slots_info[port];
         while(current->next !=head) {
               current = current->next;
         } 
         current->next=sal_alloc(sizeof(tdm_port_slots_info_t),"TDM Pointer");
         count++;
         LOG_VERBOSE(BSL_LS_SOC_COMMON,
                     (BSL_META_U(unit,
                                 "Count=%d SkipCount:%d  Port:%d  Addr:%p\n"),
                      count,skip_count,port,(void *)current->next));

         current->next->position=index;
         current->next->prev=current;
         current->next->next=head;
         head->prev=current->next;
   }
   if (idle_rule == 0) {
       /* Special case */
       if (!((tdm[0] == ML_IDLE) &&
             (tdm[total_tdm_slots-1] == ML_IDLE))) {
              LOG_ERROR(BSL_LS_SOC_COMMON,
                       (BSL_META_U(unit,
                       "### Internal Error: TDM Verification failed \n"
                       "### Two consecutive idle not found at Edges \n"
                       "### TCAM Atomicity might get affected.\n")));
           *offender_port = ML_IDLE1;
           return SOC_E_CONFIG;
       }
   }
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Final Count=%d SkipCount:%d\n"),count,skip_count));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying rule  \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule3: Loopback (LPBK) ports require min 3 cycle spacing "
                           "among LPBK or CMIC ports \n")));
   if (ml_tdm_port_slots_info[ML_LPBK].position == -1) {
       LOG_CLI((BSL_META_U(unit,
                           "Loopback port  missing in configuration \n")));
       return SOC_E_FAIL;
   }
   if (ml_tdm_port_slots_info[ML_CMIC].position == -1) {
       LOG_CLI((BSL_META_U(unit,
                           "CMIC port  missing in configuration \n")));
       return SOC_E_FAIL;
   }
   head = current = &ml_tdm_port_slots_info[ML_LPBK];
   do {
      prev = current->prev;
      if ( current->position != prev->position ) {
           prev_tdm_slot_spacing = 
                          (current->position - prev->position) > 0 ?
                          (current->position - prev->position)-1:
                          (total_tdm_slots - prev->position + 
                           current->position) - 1;
           next_tdm_slot_spacing = 
                          (current->next->position - current->position) >0 ?
                          (current->next->position - current->position)-1:
                          (total_tdm_slots - current->position +
                           current->next->position) - 1;
      if (prev_tdm_slot_spacing < 3) {
          LOG_ERROR(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "Loopback Ports need min 3 spacing but(prev)found"
                                "(current:%d , prev:%d)=%d\n"),
                     current->position,prev->position,prev_tdm_slot_spacing));
          rv = SOC_E_FAIL;
          continue;
      } 
      if (next_tdm_slot_spacing < 3) {
          LOG_ERROR(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "Loopback Ports need min 3 spacing but(next)found"
                                "(current:%d , prev:%d)=%d\n"),
                     current->position,prev->position,next_tdm_slot_spacing));
          rv = SOC_E_CONFIG;
          *offender_port = ML_LPBK;
          continue;
      } 
      } else {
          prev_tdm_slot_spacing = next_tdm_slot_spacing = 0;
      }
#if 0
      head1 = current1 = &ml_tdm_port_slots_info[ML_CMIC];
      do {
         tdm_slot_spacing = (current->position - current1->position) > 0 ?
                          (current->position - current1->position)-1:
                          (total_tdm_slots - current1->position + 
                           current->position) - 1  ;
         if (tdm_slot_spacing < 3) {
             LOG_ERROR(BSL_LS_SOC_COMMON,
                       (BSL_META_U(unit,
                                   "Loopback and CMIC ports need min 3 spacing but "
                                   "found:%u" "(Loopack current:%d , CMIC Current:%d)\n"),
                        tdm_slot_spacing,
                        current->position,current1->position));
             rv = SOC_E_CONFIG;
             *offender_port=ML_LPBK;
             continue;
         }
         current1 = current1->next;
      }while ((current1 !=head1) && (rv == SOC_E_NONE));
#endif
      current = current->next;
   } while ((current !=head) && (rv == SOC_E_NONE));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying rules \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule1 : Each Loopback port need 2.5G bandwidth \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule2 : Each CMIC port need 2G bandwidth       \n")));
   for (index=0;index < ML_MAX_LOGICAL_PORTS && rv == SOC_E_NONE ;index++ ) {
        port = index ;
        if (ml_tdm_port_slots_info[port].position == -1) {
            continue;
        }
        LOG_VERBOSE(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                " %d ==>\n\n"),port));
        switch(port) {
        case ML_CMIC:
            LOG_VERBOSE(BSL_LS_SOC_COMMON,
                        (BSL_META_U(unit,
                                    "CMIM \n")));
            speed =2000; 
            break;
        case ML_LPBK:
            LOG_VERBOSE(BSL_LS_SOC_COMMON,
                        (BSL_META_U(unit,
                                    "LOOPBAKC \n")));
            speed =lpbk_port_speed; 
            break;
        default:
            LOG_VERBOSE(BSL_LS_SOC_COMMON,
                        (BSL_META_U(unit,
                                    " Port:%d Speed %d ==>\n\n"),
                         port,port_speed[port-1]));
            speed = port_speed[port-1];
            break;
        }
        if ((speed == 0) && (!SOC_PBMP_MEMBER((PBMP_ALL(unit)), port))) {
            /* Eagle ports are not removed from TDM calendar 
             * Eventhough not active after lane op. Ignore those
             */
             continue;
        }

        switch(speed) {
        case 1000:
            speed_index=0;
            break;
        case 2000:
            speed_index=1;
            break;
        case 2500:
            speed_index=2;
            break;
        case 10000:
        case 10500: /* Might need ut fir HG11 */
        case 11000: /* Might need ut fir HG11 */
            speed_index=3;
            break;
        case 12500: /* Special case for LPBK port */
        case 13000:
            speed_index=4;
            break;
        case 20000:
            speed_index=5;
            break;
        case 21000:
            speed_index=6;
            break;
        default:
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                                  "Unsupported speed:%d \n"),speed));
            return SOC_E_FAIL;
        }
        worse_tdm_slot_spacing=ml_tdm_cycles_info[tdm_freq_index][speed_index].
                               worse_tdm_slot_spacing;
        min_tdm_cycles=ml_tdm_cycles_info[tdm_freq_index][speed_index].
                       min_tdm_cycles;

        count=0;
        head = current = &ml_tdm_port_slots_info[port];
        do {
           prev = current->prev;
           if (current->position != prev->position ) {
               prev_tdm_slot_spacing = 
                          (current->position - prev->position)> 0 ?
                          (current->position - prev->position)-1:
                          (total_tdm_slots - prev->position + 
                           current->position) - 1  ;
               next_tdm_slot_spacing = 
                          (current->next->position - current->position) > 0 ?
                          (current->next->position - current->position)-1:
                          (total_tdm_slots - current->position + 
                           current->next->position) - 1;
           } else {
               prev_tdm_slot_spacing = next_tdm_slot_spacing = 0;
           }
           LOG_VERBOSE(BSL_LS_SOC_COMMON,
                       (BSL_META_U(unit,
                                   "Pos:%d Spacing (Prev %d - %d =  )%d"
                                   "(Next %d - %d =  )%d\n"), current->position,
                        current->position , prev->position ,
                        prev_tdm_slot_spacing, current->next->position , 
                        current->position , next_tdm_slot_spacing));
           if ((prev_tdm_slot_spacing > worse_tdm_slot_spacing) ||
               (next_tdm_slot_spacing > worse_tdm_slot_spacing)) {
                if (port == ML_CMIC) {
                    /* Exception for worst TDM slot spacing for CMIC port */
                    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                              (BSL_META_U(unit,
                               "WorseSpacing:%d (prev:%d next:%d)"
                               "NOK !!!! port:%d\n"),
                                worse_tdm_slot_spacing,
                                prev_tdm_slot_spacing, next_tdm_slot_spacing,
                               port));
                    LOG_VERBOSE(BSL_LS_SOC_COMMON,
                              (BSL_META_U(unit,"**ATTN:SKIPPING FOR TIME-BEING \n")));
                } else {
                    LOG_ERROR(BSL_LS_SOC_COMMON,
                              (BSL_META_U(unit,
                               "WorseSpacing:%d (prev:%d next:%d)"
                               "NOK !!!! port:%d\n"),
                                worse_tdm_slot_spacing,
                                prev_tdm_slot_spacing, next_tdm_slot_spacing,
                               port));
                    rv = SOC_E_CONFIG;
                    *offender_port=port;
                    continue;
                } 
           }
           count++;
           current = current->next;
        } while ((current !=head) && (rv == SOC_E_NONE)) ;
        LOG_VERBOSE(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "TDM Cycles: %d \n"),count));
        if (count < min_tdm_cycles) {
            LOG_ERROR(BSL_LS_SOC_COMMON,
                      (BSL_META_U(unit,
                                  "min_tdm_cycles:%dNOK  !!!! port:%d\n"),
                       min_tdm_cycles,port));
            rv =  SOC_E_CONFIG;
            *offender_port=port;
            continue;
        }
        LOG_VERBOSE(BSL_LS_SOC_COMMON,
                    (BSL_META_U(unit,
                                "n== %d <==\n\n"),port));
   }

   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying rule  \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Rule4 : Each subport in MXQPORT operates with 4 cycle TDM \n")));
   LOG_VERBOSE(BSL_LS_SOC_COMMON,
               (BSL_META_U(unit,
                           "Verifying MXQports spacing concern\n")));
   for(mxqblock=0;mxqblock<(ML_MAX_BLOCKS-1) && rv == SOC_E_NONE ;mxqblock++) {
       for(index=0;
           index<ML_MAX_PORTS_PER_BLOCK && rv == SOC_E_NONE;
           index++) {
           outer_port = (*ml_block_ports[unit])[mxqblock][index];
           if (outer_port == 0xFF) {
               if ((mxqblock == 7)  && (index == 3)) {
                    outer_port = 40;
               } else {
                   continue;
               }
           }
           if (ml_tdm_port_slots_info[outer_port].position == -1) {
               continue;
           }
           head = current = &ml_tdm_port_slots_info[outer_port];
           do {
              for(loop=0;loop<ML_MAX_PORTS_PER_BLOCK; loop++) {
                  inner_port=(*ml_block_ports[unit])[mxqblock][loop];
                  if (inner_port == 0xFF) {
                      if ((mxqblock == 7)  && (loop == 3)) {
                           inner_port = 40;
                      } else {
                          continue;
                      }
                  }
                  if ( inner_port == outer_port) {
                       continue;
                  }
                  if (ml_tdm_port_slots_info[inner_port].position == -1) {
                      continue;
                  }
                  head1 = current1 = &ml_tdm_port_slots_info[inner_port];
                  do {
                       spacing = (current->position - current1->position) > 0 ?
                                 (current->position - current1->position)-1:
                                 (total_tdm_slots - current1->position +
                                  current->position) - 1;
                       if (spacing < 3) {
                           LOG_ERROR(BSL_LS_SOC_COMMON,
                                     (BSL_META_U(unit,
                                                 "Outer Port:%d Inner Port:%d "
                                                 "MXQSpacing Issue"
                                                 "Expected > 4 but observed %d\n"),
                                      outer_port,inner_port,spacing));
                           rv = SOC_E_CONFIG;
                           *offender_port=outer_port;
                           continue;
                       }
                       current1 = current1->next;
                  } while ((current1 !=head1) && (rv == SOC_E_NONE));
              }
              current = current->next;
         } while ((current !=head) && (rv == SOC_E_NONE));
      }
  }

  /* Free allocated resources */
  count=0;
  for (port=0;port < ML_MAX_LOGICAL_PORTS ; port++) {
       head = current = &ml_tdm_port_slots_info[port];
       do {
          temp = current->next;
          if (current != head) {
              count++;
              LOG_VERBOSE(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                                      "Freed count :%d\n"),count));
              sal_free(current);
          }          
          current = temp;
       } while (current != head);
       ml_tdm_port_slots_info[port].prev=NULL;
       ml_tdm_port_slots_info[port].next=NULL;
       ml_tdm_port_slots_info[port].position = -1;
  }
  sal_memcpy(&ml_current_tdm_cycles_info,
             &ml_tdm_cycles_info[tdm_freq_index][0],
             sizeof(tdm_cycles_info_t)*KT2_MAX_SPEEDS);
  return rv;
    return SOC_E_NONE;
}
#endif
#if 0
void soc_metrolite_save_tdm_pos(int unit, uint32 new_tdm_size,uint32 *new_tdm) {
    uint32 pos=0;
    uint8 port=0;
    uint8 block=0;
    uint8 total_slots=0;
    
    sal_memset(ml_tdm_pos_info,0,sizeof(ml_tdm_pos_info));
    for (pos = 0; pos < new_tdm_size ; pos++) {
         port= new_tdm[pos];
         if ((port == ML_IDLE) || (port == ML_LPBK) || 
             (port == ML_CMIC)) {
              continue;
         }
         if(port > ML_MAX_PHYSICAL_PORTS ) {
             LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                             "tdm_size %d, pos %d, port %d \n"),
                               new_tdm_size, pos, port));

         } else {
             block = (*ml_port_to_block[unit])[port - 1];
             total_slots = ml_tdm_pos_info[block].total_slots;
             ml_tdm_pos_info[block].pos[total_slots]=pos;
             ml_tdm_pos_info[block].total_slots++;
         }
    }

    sal_memcpy(ml_current_tdm,new_tdm,new_tdm_size*sizeof(new_tdm[0]));
    ml_current_tdm_size=new_tdm_size;

}

/* This function splits the occurance of first port of the block into 4 ports */
/* Make sure that the tdm of the block is not already split */
void ml_block_tdm_split(int unit, uint32 *tdm,
        uint32 total_tdm_slots, uint32 block)
{
     uint32 index=0, count=0;
     uint32 first_port;

     first_port = (*ml_block_ports[unit])[block][0];
     for (index=0; index < total_tdm_slots ; index++ ) {
         /* Split first port occurance in to 4 */
          if (tdm[index] == first_port) {
              tdm[index] = first_port + (count % 4);
              count++;
          }

     }
}

void ml_tdm_replace(uint32 *tdm, uint32 total_tdm_slots,
                     uint32  src, uint32 dst,uint32 one_time)
{
     uint32 index=0;
     for (index=0; index < total_tdm_slots ; index++ ) {
          if (tdm[index] == src) {
              tdm[index] = dst;
              if (one_time) {
                  break;
              }
          }
     }
}

void ml_tdm_swap(uint32 *tdm, uint32 total_tdm_slots,
                  uint32  src, uint32 dst)
{
     uint32 index=0;
     uint32 temp_index=0;
     uint32 temp=0;
     for (index=0; index < total_tdm_slots ; index++ ) {
          if (tdm[index] == src) {
              temp_index=index;
          }
          if (tdm[index] == dst) {
              temp = tdm[temp_index];
              tdm[temp_index]=dst;
              tdm[index]=temp;
          }
     }
}

soc_error_t
soc_metrolite_reconfigure_tdm(int unit,uint32 new_tdm_size,uint32 *new_tdm)
{
    uint8                   new_tdm_no=0;
    soc_mem_t               tdm_table[]={IARB_TDM_TABLEm , IARB_TDM_TABLE_1m};
    soc_field_t             wrap_ptr[]={TDM_WRAP_PTRf , TDM_1_WRAP_PTRf};
    uint32                  lls_tdm_size=0;
    lls_port_tdm_entry_t    *lls_tdm=NULL;
    uint32                  iarb_size=0;
    iarb_tdm_table_entry_t  *iarb_tdm=NULL;
    int                     iter=0;
    uint32                  index;
    uint32                  rval;
    int                     cfg_num;

    SOC_IF_ERROR_RETURN(_soc_metrolite_get_cfg_num(unit, 0, &cfg_num));
    if (cfg_num >= (sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))) {
        return SOC_E_FAIL;
    } 
    
    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    old_tdm_no = soc_reg_field_get(unit, IARB_TDM_CONTROLr, rval, SELECT_TDMf);
    new_tdm_no = (old_tdm_no + 1)%2;

    iarb_size =  soc_mem_index_count(unit,IARB_TDM_TABLEm) *
                 sizeof(iarb_tdm_table_entry_t);
    iarb_tdm = soc_cm_salloc(unit,iarb_size, "iarb_tdm_table_entry_t");
    if (iarb_tdm == NULL) {
        return SOC_E_MEMORY;
    }            
    sal_memset(iarb_tdm,0,iarb_size);

    lls_tdm_size =  soc_mem_index_count(unit,LLS_PORT_TDMm) *
                    sizeof(lls_port_tdm_entry_t);
    lls_tdm = soc_cm_salloc(unit,lls_tdm_size, "lls_port_tdm_entry_t");
    if (lls_tdm == NULL) {
        soc_cm_sfree(unit,iarb_tdm);
        return SOC_E_MEMORY;
    }
    sal_memset(lls_tdm,0,lls_tdm_size);

    for (index = 0; index < new_tdm_size; index++) {
        soc_IARB_TDM_TABLEm_field32_set(unit, &iarb_tdm[index], PORT_NUMf,
                                        new_tdm[index]);
    }   
    soc_mem_write_range(unit, tdm_table[new_tdm_no], MEM_BLOCK_ALL, 0,
                        new_tdm_size, iarb_tdm);
    soc_cm_sfree(unit,iarb_tdm);        

    for (index = 0; index < new_tdm_size/2; index++) {
         soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                       PORT_ID_0f, new_tdm[index*2]);
         if ( new_tdm[index*2] < ML_IDLE ) {
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_0_ENABLEf, 1);
         } else {
              LOG_VERBOSE(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                                      "IDLE SLOTs so PORT_ID_0_ENABLEf=0 \
                                       for index=%d\n"), index));
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_0_ENABLEf, 0);
         }

         soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                       PORT_ID_1f, new_tdm[(index*2) + 1]);
         if ( new_tdm[(index*2)+1] < ML_IDLE ) {
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_1_ENABLEf, 1);
         } else {
              LOG_VERBOSE(BSL_LS_SOC_COMMON,
                          (BSL_META_U(unit,
                                      "IDLE SLOTs so PORT_ID_1_ENABLEf=0 \
                                       for index=%d\n"), index));
              soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index],
                                            PORT_ID_1_ENABLEf, 0);
         } 
    } /* for index */

    if (new_tdm_size % 2) {
        LOG_CLI((BSL_META_U(unit,           
                            "ODD TDM SIZE \n")));
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index*2],
                                      PORT_ID_0_ENABLEf, 1);
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[index*2],
                                      PORT_ID_0f, new_tdm[(index*2)]);
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[(index*2)+1],
                                      PORT_ID_1_ENABLEf, 0);
        soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm[(index*2)+1],
                                      PORT_ID_1f, 0);
        index++;
    }

    soc_mem_write_range(unit, LLS_PORT_TDMm, MEM_BLOCK_ALL,
                        new_tdm_no*256, (new_tdm_no*256) + index,
                        lls_tdm);
    soc_cm_sfree(unit,lls_tdm);

    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, DISABLEf, 0);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, 
                      wrap_ptr[new_tdm_no],new_tdm_size -1);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, SELECT_TDMf, new_tdm_no);
    SOC_IF_ERROR_RETURN(WRITE_IARB_TDM_CONTROLr(unit, rval));

    if (bsl_check(bslLayerSoc, bslSourceCommon, bslSeverityVerbose, unit)) {
        kt2_tdm_display(unit,new_tdm,new_tdm_size,
                        bcm56270_tdm_info[cfg_num].row,
                        bcm56270_tdm_info[cfg_num].col);
    }

    SOC_IF_ERROR_RETURN(WRITE_LLS_TDM_CAL_CFG_SWITCHr(unit, 1));
    if ((SAL_BOOT_BCMSIM || SAL_BOOT_PLISIM)) {
        SOC_IF_ERROR_RETURN(READ_LLS_TDM_CAL_CFGr(unit, &rval));
        soc_reg_field_set(unit, LLS_TDM_CAL_CFGr, &rval,
                          CURRENT_CALENDARf,new_tdm_no);
        SOC_IF_ERROR_RETURN(WRITE_LLS_TDM_CAL_CFGr(unit, rval));
    }

    do {
        SOC_IF_ERROR_RETURN(READ_LLS_TDM_CAL_CFGr(unit, &rval));
        sal_udelay(100);
        if (soc_reg_field_get(unit, LLS_TDM_CAL_CFGr, rval,
                              CURRENT_CALENDARf) == new_tdm_no) {
            break;
        }
    } while (iter++ < 100000);

    if (iter >= 100000) {
        LOG_ERROR(BSL_LS_SOC_COMMON,
                  (BSL_META_U(unit, "LLS Calendar switch failed !!\n")));
        return SOC_E_INTERNAL;
    }

    old_tdm_no = new_tdm_no;
    soc_metrolite_save_tdm_pos(unit, new_tdm_size,new_tdm);

    return SOC_E_NONE;
}
#endif

STATIC soc_error_t      
_soc_metrolite_mmu_tdm_init(int unit) 
{
    soc_error_t     rv = SOC_E_NONE;
    uint32 *arr=NULL;
    uint32  row = 0, col = 0;
#if 0
    uint32 offender_port=0;
#endif

    int i, tdm_size = 0,tdm_freq = 0, cfg_num;
    iarb_tdm_table_entry_t iarb_tdm;
    lls_port_tdm_entry_t lls_tdm;
    uint32 rval, arr_ele;
    uint16 dev_id;
    uint8 rev_id;
    uint32 port_enable_value=0;
    /*int loop_index, block;*/

    soc_cm_get_id(unit, &dev_id, &rev_id);
    SOC_IF_ERROR_RETURN(_soc_metrolite_get_cfg_num(unit, 0, &cfg_num));
    if (cfg_num >= (sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))) {
        LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                   "Wrong cfg_num:%d exceeding max cfg_num: %d\n"),
                   cfg_num,
                   (int)(sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))));
        return SOC_E_FAIL;
    } 

    switch(dev_id) {
    case BCM56270_DEVICE_ID:
    case BCM56271_DEVICE_ID:
    case BCM56272_DEVICE_ID:

    case BCM53460_DEVICE_ID:
    case BCM53461_DEVICE_ID:

        tdm_size= bcm56270_tdm_info[cfg_num].tdm_size;
        tdm_freq= bcm56270_tdm_info[cfg_num].tdm_freq;
        row= bcm56270_tdm_info[cfg_num].row;
        col= bcm56270_tdm_info[cfg_num].col;
        LOG_DEBUG(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                   "Cfg=%d freq=%d size=%d raw=%d col=%d \n"),
                   cfg_num,tdm_freq,tdm_size,row,col));
        arr = bcm56270_tdm[cfg_num];

        switch(cfg_num) {
        /* ------------------- */
        /* 56270 Configuration */
        /* ------------------- */
        case BCM56270_DEVICE_ID_OFFSET_CFG + 1:
             /* 56270 */
             /* 4x 1G/2.5G + 4xXFI + 4x XFI/HGs11 + 2.5G LPBK */
             sal_memcpy(arr,
                        &ml_tdm_56270_A_ref[0],sizeof(ml_tdm_56270_A_ref));
             break;

        /* ------------------- */
        /* 56271 Configuration */
        /* ------------------- */
        case BCM56271_DEVICE_ID_OFFSET_CFG + 1:
             /* 56271 */
             /* 8x 1G/2.5G + 4xXFI + 2.5G LPBK */
             sal_memcpy(arr,
                        &ml_tdm_56271_C_ref[0],sizeof(ml_tdm_56271_C_ref));
             break;

        case BCM56271_DEVICE_ID_OFFSET_CFG + 2:
             /* 56271 */
             /* 2x1G/2.5G/10G + 4x1G/2.5G G.INT */
             sal_memcpy(arr,
                        &ml_tdm_56271_C_ref[0],sizeof(ml_tdm_56271_C_ref));

             if(soc_property_get(unit, spn_SAT_ENABLE, 0) == 0){
                 ml_tdm_replace(arr,tdm_size, 6, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 8, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 9, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 10, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 11, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 12, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 5, 9, 0);
                 ml_tdm_replace(arr,tdm_size, 7, 11, 0);
             }else{
                /* SAT port (port 5) has to be enabled when SAT is enabled */
                 ml_tdm_replace(arr,tdm_size, 6, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 8, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 9, ML_IDLE_1, 0);
                 ml_tdm_replace(arr,tdm_size, 5, 9, 0);
                 ml_tdm_replace(arr,tdm_size, 10, 5, 0);
                 ml_tdm_replace(arr,tdm_size, 11, 5, 0);
                 ml_tdm_replace(arr,tdm_size, 12, 5, 0);
                 ml_tdm_replace(arr,tdm_size, ML_IDLE_1, 5, 0);
                 ml_tdm_replace(arr,tdm_size, 7, 11, 0);

             }
             break;

        case BCM56271_DEVICE_ID_OFFSET_CFG + 3:
             /* 56271 */
             /* 4x1G/2.5G/10G + 4x1G/2.5G G.INT */
             sal_memcpy(arr,
                        &ml_tdm_56271_C_ref[0],sizeof(ml_tdm_56271_C_ref));
             if(soc_property_get(unit, spn_SAT_ENABLE, 0) == 0){
                 ml_tdm_replace(arr,tdm_size, 9, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 10, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 11, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 12, ML_IDLE, 0);
                 ml_tdm_replace(arr,tdm_size, 5, 9, 0);
                 ml_tdm_replace(arr,tdm_size, 6, 10, 0);
                 ml_tdm_replace(arr,tdm_size, 7, 11, 0);
                 ml_tdm_replace(arr,tdm_size, 8, 12, 0);
             }else {
                /* SAT port (port 5) has to be enabled when SAT is enabled */
                 ml_tdm_replace(arr,tdm_size, 9, ML_IDLE_1, 0);
                 ml_tdm_replace(arr,tdm_size, 10, ML_IDLE_1, 0);
                 ml_tdm_replace(arr,tdm_size, 11, ML_IDLE_1, 0);
                 ml_tdm_replace(arr,tdm_size, 12, ML_IDLE_1, 0);

                 ml_tdm_replace(arr,tdm_size, 5, 9, 0);
                 ml_tdm_replace(arr,tdm_size, 6, 10, 0);
                 ml_tdm_replace(arr,tdm_size, 7, 11, 0);
                 ml_tdm_replace(arr,tdm_size, 8, 12, 0);

                 ml_tdm_replace(arr,tdm_size, ML_IDLE_1, 5, 0);
                 ml_tdm_replace(arr,tdm_size, ML_IDLE_1, 5, 0);
                 ml_tdm_replace(arr,tdm_size, ML_IDLE_1, 5, 0);
                 ml_tdm_replace(arr,tdm_size, ML_IDLE_1, 5, 0);
             }
             break;


        /* ------------------- */
        /* 56272 Configuration */
        /* ------------------- */
        case BCM56272_DEVICE_ID_OFFSET_CFG + 1:
             /* 56272 */
             /* 8xGE + 2.5G LPBK */
             sal_memcpy(arr,
                        &ml_tdm_56272_B_ref[0],sizeof(ml_tdm_56272_B_ref));
             break;

        case BCM56272_DEVICE_ID_OFFSET_CFG + 2:
             /* 56272 */
             /* 2x1G + 4x1G G.INT */
             sal_memcpy(arr,
                        &ml_tdm_56272_B_ref[0],sizeof(ml_tdm_56272_B_ref));
             ml_tdm_replace(arr,tdm_size, 10, ML_IDLE, 0);
             ml_tdm_replace(arr,tdm_size, 12, ML_IDLE, 0);
             break;

#ifdef BCM_WARM_BOOT_SUPPORT
        case COUNTOF(bcm56270_tdm_info) - 1:
             if (SOC_WARM_BOOT(unit)) {
                 sal_memcpy(arr,
                         &ml_scache_tdm[0], sizeof(ml_scache_tdm));
                 break;
             }
#endif
        /* Fall thru */
        default:
             LOG_WARN(BSL_LS_SOC_COMMON, (BSL_META_U(unit, "Invalid cfg_num\n")));
             return SOC_E_FAIL;
        }
        break;
    default:
             LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit,  "Invalid DevId\n")));
             return SOC_E_FAIL;
    }

    /* Reconfigure TDM based on portgroup settings */
/* portgroup will be implemented later */
#if 0
    loop_index = 0;
    while(ml_selected_port_details[loop_index].start_port_no != 0) {
        block = loop_index;

        /* Change TDM only if the portgroup has been modified */
        if (ml_selected_port_details[loop_index].port_incr ==
                ml_selected_port_details_orig[loop_index].port_incr) {
            loop_index++;
            continue;
        }

        switch (ml_selected_port_details[loop_index].port_incr){
            case PORTGROUP_SINGLE_MODE:
                if(ml_selected_port_details_orig[loop_index].port_incr !=
                        PORTGROUP_QUAD_MODE) {
                    LOG_VERBOSE(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                                    "Setting TDM to Single Mode\n")));
                    for(i=1; i<ML_MAX_PORTS_PER_BLOCK; i++) {
                        ml_tdm_replace(arr,tdm_size,
                                (*ml_block_ports[unit])[block][i],
                                (*ml_block_ports[unit])[block][0], 0);
                    }
                }
                break;
            case PORTGROUP_DUAL_MODE:
                /* If original is quad mode, then we already have enough
                 * TDM slots for dual mode as well */
                if(ml_selected_port_details_orig[loop_index].port_incr !=
                        PORTGROUP_QUAD_MODE) {
                    LOG_VERBOSE(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                                "Setting TDM to Dual Mode\n")));
                    /* Convert single to Quad mode and then split */
                    ml_block_tdm_split(unit, arr, tdm_size, block);
                    for(i=1; i<ML_MAX_PORTS_PER_BLOCK; i+=2) {
                        ml_tdm_replace(arr,tdm_size,
                                (*ml_block_ports[unit])[block][i],
                                (*ml_block_ports[unit])[block][i-1], 0);
                    }
                }
                break;
            case PORTGROUP_QUAD_MODE:
                LOG_VERBOSE(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                                "Setting TDM to Quad Mode\n")));
                /* Merge the slots and then split */
                /* This will take care of dual to quad block */
                for(i=1; i<ML_MAX_PORTS_PER_BLOCK; i++) {
                    ml_tdm_replace(arr,tdm_size,
                            (*ml_block_ports[unit])[block][i],
                            (*ml_block_ports[unit])[block][0], 0);
                }
                ml_block_tdm_split(unit, arr, tdm_size, block);
                break;
            default:
                return SOC_E_INTERNAL;
        }
        loop_index++;
    }
#endif
    /* Verify the TDM structure */
     kt2_tdm_display(unit,arr, tdm_size,  row,  col);
#if 0
     rv = ml_tdm_verify(unit, (uint32 *)bcm56270_tdm[cfg_num], tdm_size,
                        tdm_freq, (uint32 *)bcm56270_speed[unit][cfg_num],
                        lpbk_port_speed, &offender_port);
    if ((rv == SOC_E_CONFIG) && (offender_port == ML_IDLE)) {
        rv = SOC_E_NONE;
    }
    SOC_IF_ERROR_RETURN(rv);
#endif

    /* Disable IARB TDM before programming... */
    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, DISABLEf, 1);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, TDM_WRAP_PTRf,
                      tdm_size -1);
    SOC_IF_ERROR_RETURN(WRITE_IARB_TDM_CONTROLr(unit, rval));

    for (i = 0; i < tdm_size; i++) {
        arr_ele = arr[i];
        if (arr_ele < ML_IDLE) { /* Non Idle Slots */
            port_enable_value = 1;
        } else {
            port_enable_value = 0;
        }

        sal_memset(&iarb_tdm, 0, sizeof(iarb_tdm_table_entry_t));
        soc_IARB_TDM_TABLEm_field32_set(unit, &iarb_tdm, PORT_NUMf,
                                        arr_ele);
        SOC_IF_ERROR_RETURN(WRITE_IARB_TDM_TABLEm(unit, SOC_BLOCK_ALL, i,
                                                  &iarb_tdm));

        if((i % 2) == 0) {
            /* Two entries per mem entry */
            sal_memset(&lls_tdm, 0, sizeof(lls_port_tdm_entry_t));

            soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm, PORT_ID_0f, arr_ele);
            soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm,
                    PORT_ID_0_ENABLEf, port_enable_value);
        } else {
            soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm, PORT_ID_1f, arr_ele);
            soc_LLS_PORT_TDMm_field32_set(unit, &lls_tdm,
                    PORT_ID_1_ENABLEf, port_enable_value);

            SOC_IF_ERROR_RETURN(WRITE_LLS_PORT_TDMm(unit, SOC_BLOCK_ALL, (i/2),
                        &lls_tdm));
        }
    }

    if (tdm_size % 2) {
        LOG_DEBUG(BSL_LS_SOC_COMMON, (BSL_META_U(unit, "Info:Odd TDM Size%d \n"),tdm_size));
        SOC_IF_ERROR_RETURN(WRITE_LLS_PORT_TDMm(unit, SOC_BLOCK_ALL, (i/2),
                                                &lls_tdm));
    }

    SOC_IF_ERROR_RETURN(READ_IARB_TDM_CONTROLr(unit, &rval));
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, DISABLEf, 0);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, TDM_WRAP_PTRf,
                      tdm_size -1);
    soc_reg_field_set(unit, IARB_TDM_CONTROLr, &rval, IDLE_PORT_NUM_SELf, 1);
    SOC_IF_ERROR_RETURN(WRITE_IARB_TDM_CONTROLr(unit, rval));

    rval = 0;
    soc_reg_field_set(unit, LLS_TDM_CAL_CFGr, &rval, END_Af, tdm_size - 1);
    soc_reg_field_set(unit, LLS_TDM_CAL_CFGr, &rval, END_Bf, tdm_size - 1);
    soc_reg_field_set(unit, LLS_TDM_CAL_CFGr, &rval, ENABLEf, 1);
    SOC_IF_ERROR_RETURN(WRITE_LLS_TDM_CAL_CFGr(unit, rval));

    soc_metrolite_save_tdm_pos(unit, tdm_size, arr);

    return rv;
}

soc_error_t soc_metrolite_get_port_block(int unit,
                                         soc_port_t port, uint8 *block)
{
    /* Return invalid port for all except physical port */
    if (!((port > 0 ) && (port < 13))) {
        return SOC_E_PORT;
    }

    *block = (*ml_port_to_block[unit])[port - 1];

    return SOC_E_NONE;
}

int soc_metrolite_hw_reset_control_init(int unit) {
    uint32              rval;
    soc_timeout_t       to;
    int                 pipe_init_usec;

    /* Reset IPITE and EPIPE block */
    rval = 0;
    SOC_IF_ERROR_RETURN(WRITE_ING_HW_RESET_CONTROL_1r(unit, rval));
    soc_reg_field_set(unit, ING_HW_RESET_CONTROL_2r, &rval, RESET_ALLf, 1);
    soc_reg_field_set(unit, ING_HW_RESET_CONTROL_2r, &rval, VALIDf, 1);
    soc_reg_field_set(unit, ING_HW_RESET_CONTROL_2r, &rval, COUNTf, 0x4000);
    SOC_IF_ERROR_RETURN(WRITE_ING_HW_RESET_CONTROL_2r(unit, rval));

    rval = 0;
    SOC_IF_ERROR_RETURN(WRITE_EGR_HW_RESET_CONTROL_0r(unit, rval));

    rval = 0;
    SOC_IF_ERROR_RETURN(READ_EGR_HW_RESET_CONTROL_1r (unit, &rval));
    soc_reg_field_set(unit, EGR_HW_RESET_CONTROL_1r, &rval, RESET_ALLf, 1);
    soc_reg_field_set(unit, EGR_HW_RESET_CONTROL_1r, &rval, VALIDf, 1);
    soc_reg_field_set(unit, EGR_HW_RESET_CONTROL_1r, &rval, COUNTf, 0x4000);
    SOC_IF_ERROR_RETURN(WRITE_EGR_HW_RESET_CONTROL_1r(unit, rval));

    /* For simulation, set timeout to 10 sec.  Otherwise, timeout = 50 ms */
    if (SAL_BOOT_SIMULATION) {
        pipe_init_usec = 10000000;
    } else {
        pipe_init_usec = 50000;
    }
    soc_timeout_init(&to, pipe_init_usec, 0);

    /* Wait for IPIPE memory initialization done. */
    do {
        SOC_IF_ERROR_RETURN(READ_ING_HW_RESET_CONTROL_2r(unit, &rval));
        if (soc_reg_field_get(unit, ING_HW_RESET_CONTROL_2r, rval, DONEf)) {
            break;
        }
        if (soc_timeout_check(&to)) {
            LOG_WARN(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                     "ING_HW_RESET timeout\n")));
            break;
        }
    } while (TRUE);

    /* Wait for EPIPE memory initialization done. */
    do {
        SOC_IF_ERROR_RETURN(READ_EGR_HW_RESET_CONTROL_1r(unit, &rval));
        if (soc_reg_field_get(unit, EGR_HW_RESET_CONTROL_1r, rval, DONEf)) {
            break;
        }
        if (soc_timeout_check(&to)) {
            LOG_WARN(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                     "EGR_HW_RESET timeout\n")));
            break;
        }
    } while (TRUE);

    SOC_IF_ERROR_RETURN(READ_ING_HW_RESET_CONTROL_2r(unit, &rval));
    soc_reg_field_set(unit, ING_HW_RESET_CONTROL_2r, &rval, RESET_ALLf, 0);
    soc_reg_field_set(unit, ING_HW_RESET_CONTROL_2r, &rval,
                        CMIC_REQ_ENABLEf, 1);
    SOC_IF_ERROR_RETURN(WRITE_ING_HW_RESET_CONTROL_2r(unit, rval));

    SOC_IF_ERROR_RETURN(READ_EGR_HW_RESET_CONTROL_1r(unit, &rval));
    soc_reg_field_set(unit, EGR_HW_RESET_CONTROL_1r, &rval, RESET_ALLf, 0);
    SOC_IF_ERROR_RETURN(WRITE_EGR_HW_RESET_CONTROL_1r(unit, rval));

    return SOC_E_NONE;
}

soc_error_t soc_metrolite_get_mxq_phy_port_mode(
        int unit, soc_port_t port,int speed, bcmMxqPhyPortMode_t *mode) {

    soc_info_t  *si = &SOC_INFO(unit);

    if (!SOC_PBMP_MEMBER((PBMP_ALL(unit)), port)) {
        return SOC_E_PORT;
    }

    if(!IS_MXQ_PORT(unit, port)){
        return SOC_E_NONE;
    }

    if (speed <= 2500) {
        *mode=bcmMxqPhyPortModeQuad;
        si->port_num_lanes[port] = 1;
        return SOC_E_NONE;
    } else if (speed >= 10000) {
        *mode=bcmMxqPhyPortModeSingle;
        si->port_num_lanes[port] = 4;
        return SOC_E_NONE;
    } else {
        LOG_WARN(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                        "Invalid speed for setting phy_port_mode\n")));
        return SOC_E_CONFIG;
    }

}   

soc_error_t soc_metrolite_get_xl_phy_core_port_mode(
        int unit, soc_port_t port, 
        bcmXlPhyPortMode_t *phy_mode,
        bcmXlCorePortMode_t *core_mode) {

    uint8   block=0;
    uint8   loop=0;
    uint8   port_used[ML_MAX_PORTS_PER_BLOCK]={0, 0, 0, 0};
    uint8   num_ports=0;
    int     cfg_num;
    char    *intf_type = NULL;
    uint32  rxaui = 0;
    soc_port_t  first_port;
    soc_info_t  *si = &SOC_INFO(unit);
#ifdef BCM_WARM_BOOT_SUPPORT
    uint32 rval = 0, oamp_status = 0;
#endif

    if (!SOC_PBMP_MEMBER((PBMP_ALL(unit)), port)) {
        return SOC_E_PORT;
    }

    if(!IS_XL_PORT(unit, port)) {
        return SOC_E_NONE;
    }

    SOC_IF_ERROR_RETURN(_soc_metrolite_get_cfg_num(unit, 0, &cfg_num));
    if (cfg_num >= (sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))) {
        return SOC_E_FAIL;
    }

    SOC_IF_ERROR_RETURN(soc_metrolite_get_port_block(unit,port,&block));
    first_port = (*ml_block_ports[unit])[block][0];

    for(loop=0;loop<ML_MAX_PORTS_PER_BLOCK; loop++) {

        if ((bcm56270_speed[unit][cfg_num]
                    [(block*ML_MAX_PORTS_PER_BLOCK)+loop]) &&
                (SOC_PBMP_MEMBER((PBMP_ALL(unit)), 
                                 (block*ML_MAX_PORTS_PER_BLOCK)+loop+1))){
            port_used[loop] = 1;
            num_ports++;
        }
#ifdef BCM_WARM_BOOT_SUPPORT
        SOC_IF_ERROR_RETURN(READ_OAMP_ENABLEr(unit, &rval));
        oamp_status = soc_reg_field_get(unit, OAMP_ENABLEr, rval, ENABLEf);

        if ((SOC_WARM_BOOT(unit) && (block == 1))) {
            if ((bcm56270_speed[unit][cfg_num]
                        [(block*ML_MAX_PORTS_PER_BLOCK)+loop] == 0) &&
                    (oamp_status == 1)){

                port_used[loop] = 1;
                num_ports++;
            }
        }
#endif
    }

    switch(num_ports){
        case 0: return SOC_E_PARAM;
        case 1: *phy_mode=bcmXlPhyPortModeSingle;
                *core_mode=bcmXlCorePortModeSingle;
                si->port_num_lanes[first_port] = 4;
                si->port_num_lanes[first_port + 1] = 0;
                si->port_num_lanes[first_port + 2] = 0;
                si->port_num_lanes[first_port + 3] = 0;
                break;
        case 2:
                *phy_mode=bcmXlPhyPortModeDual;
                *core_mode=bcmXlCorePortModeDual;
                intf_type= soc_property_port_get_str(unit, port, spn_SERDES_IF_TYPE);

                if (intf_type != NULL) {
                    if ((sal_strcmp(intf_type, "RXAUI") == 0) ||
                            (sal_strcmp(intf_type, "rxaui") == 0)) {
                        /* mode : RXAUI */
                        si->port_num_lanes[first_port] = 2;
                        si->port_num_lanes[first_port + 1] = 0;
                        si->port_num_lanes[first_port + 2] = 2;
                        si->port_num_lanes[first_port + 3] = 0;
                    } else if ((sal_strcmp(intf_type, "XFI") == 0) ||
                            (sal_strcmp(intf_type, "xfi") == 0)) {
                        /* mode : 2xXFI */
                        si->port_num_lanes[first_port] = 1;
                        si->port_num_lanes[first_port + 1] = 0;
                        si->port_num_lanes[first_port + 2] = 1;
                        si->port_num_lanes[first_port + 3] = 0;
                    }
                }

                rxaui =  soc_property_port_get(unit, port,
                        spn_SERDES_RXAUI_MODE, 0xFF);
                if ((rxaui == 0) || (rxaui == 1)) {
                    /* mode : RXAUI */
                    si->port_num_lanes[first_port] = 2;
                    si->port_num_lanes[first_port + 1] = 0;
                    si->port_num_lanes[first_port + 2] = 2;
                    si->port_num_lanes[first_port + 3] = 0;
                } else {
                    /* mode : 2xXFI */
                    si->port_num_lanes[first_port] = 1;
                    si->port_num_lanes[first_port + 1] = 0;
                    si->port_num_lanes[first_port + 2] = 1;
                    si->port_num_lanes[first_port + 3] = 0;
                }
                break;
        case 3: if(port_used[0] && port_used[2] && port_used[3]) {
                    *phy_mode = bcmXlPhyPortModeTri023;
                    *core_mode = bcmXlCorePortModeTri023;
                    si->port_num_lanes[first_port] = 2;
                    si->port_num_lanes[first_port + 1] = 0;
                    si->port_num_lanes[first_port + 2] = 1;
                    si->port_num_lanes[first_port + 3] = 1;
                } else if (port_used[0] && port_used[1] && port_used[2]) {
                    *phy_mode = bcmXlPhyPortModeTri012;
                    *core_mode = bcmXlCorePortModeTri012;
                    si->port_num_lanes[first_port] = 1;
                    si->port_num_lanes[first_port + 1] = 1;
                    si->port_num_lanes[first_port + 2] = 2;
                    si->port_num_lanes[first_port + 3] = 0;
                } else {
                    return SOC_E_PARAM; 
                } 
                break;
        case 4: *phy_mode=bcmXlPhyPortModeQuad;   
                *core_mode=bcmXlCorePortModeQuad;
                si->port_num_lanes[first_port] = 1;
                si->port_num_lanes[first_port + 1] = 1;
                si->port_num_lanes[first_port + 2] = 1;
                si->port_num_lanes[first_port + 3] = 1;
                break;
    }

    return SOC_E_NONE;
}



soc_error_t
soc_metrolite_port_init_config(int unit, int cfg_num, soc_port_t port) 
{
    uint32      rval, port_speed;
    bcmMxqPhyPortMode_t phy_mode = -1;
    bcmXlCorePortMode_t core_mode_xl = -1;
    bcmXlPhyPortMode_t  phy_mode_xl = -1;

    port_speed = bcm56270_speed[unit][cfg_num][port-1];
   
    if(IS_MXQ_PORT(unit, port)) {
        SOC_IF_ERROR_RETURN(soc_metrolite_get_mxq_phy_port_mode(
                    unit, port, port_speed, &phy_mode));
        if(phy_mode == -1) {
            return SOC_E_FAIL;
        }
    }
    if (SOC_REG_PORT_VALID(unit, XPORT_MODE_REGr, port)) {
        SOC_IF_ERROR_RETURN(READ_XPORT_MODE_REGr(unit, port, &rval));
        soc_reg_field_set(unit, XPORT_MODE_REGr, &rval, PHY_PORT_MODEf,      phy_mode);
        if(port_speed < 10000) {
            soc_reg_field_set(unit, XPORT_MODE_REGr, &rval,
                    PORT_GMII_MII_ENABLEf, 1);
        } else {
            soc_reg_field_set(unit, XPORT_MODE_REGr, &rval,
                    PORT_GMII_MII_ENABLEf, 0);
        }
        SOC_IF_ERROR_RETURN(WRITE_XPORT_MODE_REGr(unit, port, rval));
    }

    if (SOC_REG_PORT_VALID(unit, XPORT_MIB_RESETr, port)) {
        SOC_IF_ERROR_RETURN(WRITE_XPORT_MIB_RESETr(unit, port, 0xf));
        sal_usleep(1000);
        SOC_IF_ERROR_RETURN(WRITE_XPORT_MIB_RESETr(unit, port, 0x0));
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_CONFIGr, port)) {
        if (IS_ST_PORT(unit, port)) {
            SOC_IF_ERROR_RETURN(READ_XLPORT_CONFIGr(unit, port, &rval));
            soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, HIGIG_MODEf, 1);
             if ((soc_feature(unit, soc_feature_higig2)) &&
                     (soc_property_port_get(unit, port,
                                            spn_HIGIG2_HDR_MODE, 0))) {
                soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, HIGIG2_MODEf, 1);
             } else {
                soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, HIGIG2_MODEf, 0);
             }
            soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, MY_MODIDf, 0);
            SOC_IF_ERROR_RETURN(WRITE_XLPORT_CONFIGr(unit, port, rval));
        } else {
            SOC_IF_ERROR_RETURN(READ_XLPORT_CONFIGr(unit, port, &rval));
            soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, HIGIG_MODEf, 0);
            soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, HIGIG2_MODEf, 0);
            soc_reg_field_set(unit, XLPORT_CONFIGr, &rval, MY_MODIDf, 0);
            SOC_IF_ERROR_RETURN(WRITE_XLPORT_CONFIGr(unit, port, rval));
        }
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_MODE_REGr, port)) {
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_MODE_REGr(unit, port, 0));
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_SOFT_RESETr, port)) {
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_SOFT_RESETr(unit, port, 0xF));
    }

    if(IS_XL_PORT(unit, port)) {
        SOC_IF_ERROR_RETURN(soc_metrolite_get_xl_phy_core_port_mode(unit, port,
                &phy_mode_xl, &core_mode_xl));
        if((phy_mode_xl == -1) || (core_mode_xl == -1)){
            return SOC_E_FAIL;
        }
    }
    if (SOC_REG_PORT_VALID(unit, XLPORT_MODE_REGr, port)) {
        rval = 0;
        soc_reg_field_set(unit, XLPORT_MODE_REGr, &rval,
                EGR_1588_TIMESTAMPING_CMIC_48_ENf, 1);
        soc_reg_field_set(unit, XLPORT_MODE_REGr, &rval,
                XPORT0_CORE_PORT_MODEf,core_mode_xl);
        soc_reg_field_set(unit, XLPORT_MODE_REGr, &rval,
                XPORT0_PHY_PORT_MODEf, phy_mode_xl);
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_MODE_REGr(unit, port, rval));
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_SOFT_RESETr, port)) {
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_SOFT_RESETr(unit, port, 0x0));
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_MIB_RESETr, port)) {
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_MIB_RESETr(unit, port, 0xf));
        sal_usleep(1000);
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_MIB_RESETr(unit, port, 0x0));
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_ECC_CONTROLr, port)) {
        rval = 0;
        soc_reg_field_set(unit, XLPORT_ECC_CONTROLr, &rval,
                MIB_TSC_MEM_ENf, 1);
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_ECC_CONTROLr(unit, port, rval));
    }
    
    if (SOC_REG_PORT_VALID(unit, XLPORT_CNTMAXSIZEr, port)) {
        rval = 0;
        soc_reg_field_set(unit, XLPORT_CNTMAXSIZEr, &rval, CNTMAXSIZEf, 0x5F2);
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_CNTMAXSIZEr(unit, port, rval));
    }

    if (SOC_REG_PORT_VALID(unit, X_GPORT_CNTMAXSIZEr, port)) {
        rval = 0;
        soc_reg_field_set(unit, X_GPORT_CNTMAXSIZEr, &rval, CNTMAXSIZEf, 0x5F2);
        SOC_IF_ERROR_RETURN(WRITE_X_GPORT_CNTMAXSIZEr(unit, port, rval));
    }

    if (SOC_REG_PORT_VALID(unit, XLPORT_FLOW_CONTROL_CONFIGr, port)) {
        /* enable flow control for port macro ports */
        SOC_IF_ERROR_RETURN(READ_XLPORT_FLOW_CONTROL_CONFIGr(unit, port, &rval));
        soc_reg_field_set(unit, XLPORT_FLOW_CONTROL_CONFIGr, &rval,MERGE_MODE_ENf, 1);
        SOC_IF_ERROR_RETURN(WRITE_XLPORT_FLOW_CONTROL_CONFIGr(unit, port, rval));
    }

    return SOC_E_NONE;
}

int
_ml_ledup_init(int unit, uint16 dev_id)
{
    uint32 rval = 0;
    int ix;
    int freq, cycles;
    int refresh_rate=30, refresh_period;
    uint8 remap_value[ML_MAX_PHYSICAL_PORTS];

    /* Construct CMIC_LEDUP0_DATA_RAM port remapping */
    for (ix = 0; ix < ML_MAX_PHYSICAL_PORTS; ix++) {
        remap_value[ix] = ML_MAX_PHYSICAL_PORTS - ix;
    }

    /* Apply CMIC_LEDUP0_DATA_RAM port remapping */
    ix = 0;
    rval = 0;
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_0_3r, &rval,
                      REMAP_PORT_0f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_0_3r, &rval,
                      REMAP_PORT_1f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_0_3r, &rval,
                      REMAP_PORT_2f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_0_3r, &rval,
                      REMAP_PORT_3f, remap_value[ix++]);
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_PORT_ORDER_REMAP_0_3r(unit, rval));

    rval = 0;
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_4_7r, &rval,
                      REMAP_PORT_4f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_4_7r, &rval,
                      REMAP_PORT_5f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_4_7r, &rval,
                      REMAP_PORT_6f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_4_7r, &rval,
                      REMAP_PORT_7f, remap_value[ix++]);
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_PORT_ORDER_REMAP_4_7r(unit, rval));

    rval = 0;
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_8_11r, &rval,
                      REMAP_PORT_8f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_8_11r, &rval,
                      REMAP_PORT_9f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_8_11r, &rval,
                      REMAP_PORT_10f, remap_value[ix++]);
    soc_reg_field_set(unit, CMIC_LEDUP0_PORT_ORDER_REMAP_8_11r, &rval,
                      REMAP_PORT_11f, remap_value[ix]);
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_PORT_ORDER_REMAP_8_11r(unit, rval));


    /* Initialize the UP0 data ram */
    rval = 0;
    for (ix = 0; ix < 256; ix++) {
        /* coverity[result_independent_of_operands] */
        SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_DATA_RAMr(unit,ix, rval));
    }

    /* From Top spec, Ring 0 LED chain is connected to 28 ports
     * Ring 1 LED chain is connected to iProc AMAC0/1 ports
     * Ring 2 is not connected.
     */

    /* Apply LEDUP delays. */
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(READ_CMIC_LEDUP0_CTRLr(unit, &rval));
    soc_reg_field_set(unit,CMIC_LEDUP0_CTRLr,
                      &rval, LEDUP_SCAN_START_DELAYf, 0x6);
    soc_reg_field_set(unit,CMIC_LEDUP0_CTRLr,
                      &rval, LEDUP_SCAN_INTRA_PORT_DELAYf, 0x5);
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_CTRLr(unit, rval));

    /* Program the LED clock output frequency based on core clock */
    freq = SOC_INFO(unit).frequency;

    /* For LEDCLK_HALF_PERIOD */
    /* Formula : cycles = (freq * 10^6) * (100 * 10^-9) = freq/10 */
    /* Round up the value for non-integer clocks */
    cycles = (freq + 9) / 10 - 1;
    if (cycles < 2) {
        cycles = 2;
    }

    rval = 0;
    soc_reg_field_set(unit, CMIC_LEDUP0_CLK_DIVr, &rval,
            LEDCLK_HALF_PERIODf, cycles);
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_CLK_DIVr(unit, rval));
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP1_CLK_DIVr(unit, rval));

    /* For REFRESH_CYCLE_PERIOD */
    /* Formula : refresh_period = (freq * 10^6) / 30 */
    refresh_period = freq * 1000000 / refresh_rate;

    rval = 0;
    soc_reg_field_set(unit, CMIC_LEDUP0_CLK_PARAMSr, &rval,
            REFRESH_CYCLE_PERIODf, refresh_period);
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP0_CLK_PARAMSr(unit, rval));
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(WRITE_CMIC_LEDUP1_CLK_PARAMSr(unit, rval));

    return SOC_E_NONE;
}

int _soc_metrolite_misc_init(int unit)
{
    soc_info_t *si;
    uint32 rval;
    uint32 entry[SOC_MAX_MEM_WORDS], ing_entry[SOC_MAX_MEM_WORDS];
    soc_pbmp_t pbmp;
    int port;
    int blk;
    uint64 reg64;
    uint16 dev_id;
    uint8 rev_id;
    soc_field_t fields[3];
    uint32 values[3];
    int cfg_num;
    int rv;
    int parity_enable;
    int my_modid_list[4] = { 0, 0, 0, 0 };
    int my_modid_valid[4] = { 1, 0, 0, 0 };
    int my_modid_port_base_ptr[4] = { 0, 0, 0, 0 };
    soc_cm_get_id(unit, &dev_id, &rev_id);

    si = &SOC_INFO(unit);

    SOC_BLOCK_ITER(unit, blk, SOC_BLK_MXQPORT) {
        port = SOC_BLOCK_PORT(unit, blk);

        /* Bring XMAC out of reset */
        if (SOC_IS_METROLITE(unit)) {
            SOC_IF_ERROR_RETURN(READ_XPORT_MODE_REGr(unit,port,&rval));
            soc_reg_field_set(unit, XPORT_MODE_REGr, &rval, PORT_GMII_MII_ENABLEf,
                    0x1);
            soc_reg_field_set(unit, XPORT_MODE_REGr, &rval, PHY_PORT_MODEf,
                    0x2);
            SOC_IF_ERROR_RETURN(WRITE_XPORT_MODE_REGr(unit,port,rval));
        }
    }

    /* saber2 related hw reset control */
    if(!SOC_WARM_BOOT(unit)) {
        SOC_IF_ERROR_RETURN(_soc_saber2_hw_reset_control_init(unit));
    }

    /* core clock info in MHz updated from PRD
     * Do not modify these values until unless stated in PRD*/
    switch(dev_id) {
      case BCM56270_DEVICE_ID:
        si->frequency = 180;
        break;
      case BCM56271_DEVICE_ID:
        si->frequency = 125;
        break;
      case BCM56272_DEVICE_ID:
        si->frequency = 30;
        break;
    }

    parity_enable = soc_property_get(unit, spn_PARITY_ENABLE, FALSE);

    /* WRED Configuration */
    SOC_IF_ERROR_RETURN(READ_WRED_MISCCONFIGr(unit, &rval));
    switch(dev_id) {
      case BCM56270_DEVICE_ID:
        /* Refer the formula in the Reg file
           +       * For Metrolite 56270, frequency is 180MHZ
           +       * Calculation  is
           +       * ((512 + 128)/2 * (0.00555)) + 1 = 2.778
           +       * So we are programming 3 */
        soc_reg_field_set(unit, WRED_MISCCONFIGr, &rval, BASE_UPDATE_INTERVALf, 3);
        break;
      case BCM56271_DEVICE_ID:
        /* Refer the formula in the Reg file
           +       * For Metrolite 56271, frequency is 125MHZ
           +       * Calculation  is
           +       * ((512 + 128)/2 * (0.008)) + 1 = 3.56
           +       * So we are programming 4 */
        soc_reg_field_set(unit, WRED_MISCCONFIGr, &rval, BASE_UPDATE_INTERVALf, 4);
        break;
      case BCM56272_DEVICE_ID:
        /* Refer the formula in the Reg file
           +       * For Metrolite 56272, frequency is 30MHZ
           +       * Calculation  is
           +       * ((512 + 128)/2 * (0.0333)) + 1 = 11.667
           +       * So we are programming 12 */
        soc_reg_field_set(unit, WRED_MISCCONFIGr, &rval, BASE_UPDATE_INTERVALf, 12);
        break;
    }
    SOC_IF_ERROR_RETURN(WRITE_WRED_MISCCONFIGr(unit, rval));

    soc_saber2_ser_init(unit, parity_enable ? TRUE : FALSE);

       /* initialize LED UP0 */
        SOC_IF_ERROR_RETURN(_ml_ledup_init(unit, dev_id));

    /* Some registers are implemented in memory, need to clear them in order
     * to have correct parity value */
    PBMP_PP_ALL_ITER(unit, port) {
        SOC_IF_ERROR_RETURN(WRITE_EGR_VLAN_CONTROL_1r(unit, port, 0));
        SOC_IF_ERROR_RETURN(WRITE_EGR_IPMC_CFG2r(unit, port, 0));
    }

    SOC_IF_ERROR_RETURN(
        bcm_kt2_modid_set_all(unit, my_modid_list, my_modid_valid,
                                                    my_modid_port_base_ptr));

    sal_memset(entry, 0, sizeof(cpu_pbm_entry_t));
    soc_mem_pbmp_field_set(unit, CPU_PBMm, entry, BITMAPf, &PBMP_CMIC(unit));
    SOC_IF_ERROR_RETURN
        (soc_mem_write(unit, CPU_PBMm, MEM_BLOCK_ALL, 0, entry));

    sal_memset(entry, 0, sizeof(cpu_pbm_2_entry_t));
    soc_mem_pbmp_field_set(unit, CPU_PBM_2m, entry, BITMAPf, &PBMP_CMIC(unit));
    SOC_IF_ERROR_RETURN
        (soc_mem_write(unit, CPU_PBM_2m, MEM_BLOCK_ALL, 0, entry));

    sal_memset(entry, 0, sizeof(multipass_loopback_bitmap_entry_t));
    soc_mem_pbmp_field_set(unit, MULTIPASS_LOOPBACK_BITMAPm, entry, BITMAPf,
                           &PBMP_LB(unit));
    SOC_IF_ERROR_RETURN
        (soc_mem_write(unit, MULTIPASS_LOOPBACK_BITMAPm, MEM_BLOCK_ALL, 0,
                       entry));

    sal_memset(entry, 0, sizeof(egr_physical_port_entry_t));
    sal_memset(ing_entry, 0, sizeof(ing_physical_port_table_entry_t));

    soc_mem_field32_set(unit, EGR_PHYSICAL_PORTm, entry, PORT_TYPEf, 1);
    soc_mem_field32_set(unit, ING_PHYSICAL_PORT_TABLEm,
            ing_entry, PORT_TYPEf, 1);

    /* Higig ports */
    PBMP_ST_ITER(unit, port) {
        SOC_IF_ERROR_RETURN(soc_reg_field32_modify(
                            unit, IECELL_CONFIGr, port, HIGIG_MODEf, 1));
        SOC_IF_ERROR_RETURN(soc_reg_field32_modify(
                            unit, XLPORT_CONFIGr, port, HIGIG_MODEf, 1));
        if (IS_HL_PORT(unit,port) ||
            soc_property_port_get(unit, port, spn_HIGIG2_HDR_MODE, 0)) {
            SOC_IF_ERROR_RETURN(soc_reg_field32_modify(
                unit,IECELL_CONFIGr, port, HIGIG2_MODEf, 1));
            SOC_IF_ERROR_RETURN(soc_reg_field32_modify(
                unit, XLPORT_CONFIGr, port, HIGIG2_MODEf, 1));
            soc_mem_field32_set(unit, ING_PHYSICAL_PORT_TABLEm,ing_entry,
                                HIGIG2f,1);
            soc_mem_field32_set(unit, EGR_PHYSICAL_PORTm,entry,
                                HIGIG2f,1);
        } else {
            SOC_IF_ERROR_RETURN(soc_reg_field32_modify(
                unit, IECELL_CONFIGr, port, HIGIG2_MODEf, 0));
            SOC_IF_ERROR_RETURN(soc_reg_field32_modify(
                unit, XLPORT_CONFIGr, port, HIGIG2_MODEf, 0));
            soc_mem_field32_set(unit, ING_PHYSICAL_PORT_TABLEm,ing_entry,
                                HIGIG2f,0);
            soc_mem_field32_set(unit, EGR_PHYSICAL_PORTm,entry,
                                HIGIG2f,0);
        }
        SOC_IF_ERROR_RETURN(soc_mem_write(unit, EGR_PHYSICAL_PORTm,
            MEM_BLOCK_ALL, port, entry));
        SOC_IF_ERROR_RETURN(soc_mem_write(unit, ING_PHYSICAL_PORT_TABLEm,
            MEM_BLOCK_ALL, port, ing_entry));
    }
    
    /* CMIC higig index */
    /* Setup the cpu_hg_port specifically in HG2 mode */
    soc_mem_field32_set(unit, ING_PHYSICAL_PORT_TABLEm, ing_entry,
                        HIGIG2f, 1);
    soc_mem_field32_set(unit, EGR_PHYSICAL_PORTm,entry,
                        HIGIG2f, 1);
    SOC_IF_ERROR_RETURN(soc_mem_write( 
        unit, EGR_PHYSICAL_PORTm, MEM_BLOCK_ALL, si->cpu_hg_index, entry));
    SOC_IF_ERROR_RETURN(soc_mem_write(
        unit, ING_PHYSICAL_PORT_TABLEm, MEM_BLOCK_ALL,
        si->cpu_hg_index, ing_entry));
    
    /* Loopback port */
    soc_mem_field32_set(unit, EGR_PHYSICAL_PORTm, entry, PORT_TYPEf, 2);
    soc_mem_field32_set(unit, ING_PHYSICAL_PORT_TABLEm, ing_entry,
        PORT_TYPEf, 2);
    SOC_IF_ERROR_RETURN(soc_mem_write(
        unit, EGR_PHYSICAL_PORTm, MEM_BLOCK_ALL, si->lb_port, entry));
    SOC_IF_ERROR_RETURN(soc_mem_write(
        unit, ING_PHYSICAL_PORT_TABLEm,
        MEM_BLOCK_ALL, si->lb_port, ing_entry));
    /* ingress physical port to pp_port mapping */
    SOC_IF_ERROR_RETURN(soc_mem_field32_modify(
        unit, ING_PHYSICAL_PORT_TABLEm,
        si->lb_port, PP_PORTf, si->lb_port)); 

    /* pp_port to egress physical port mapping */
    SOC_IF_ERROR_RETURN(soc_mem_field32_modify(
        unit, PP_PORT_TO_PHYSICAL_PORT_MAPm,
        si->lb_port, DESTINATIONf,si->lb_port));

    SOC_IF_ERROR_RETURN(READ_MISCCONFIGr(unit, &rval));
    soc_reg_field_set(unit, MISCCONFIGr, &rval, METERING_CLK_ENf, 1);
    SOC_IF_ERROR_RETURN(WRITE_MISCCONFIGr(unit, rval));

    /* Enable dual hash on L2, L3 and MPLS_ENTRY tables */
    fields[0] = ENABLEf;
    values[0] = 1;
    fields[1] = HASH_SELECTf;
    values[1] = FB_HASH_CRC32_LOWER;
    fields[2] = INSERT_LEAST_FULL_HALFf;
    values[2] = 1;
    SOC_IF_ERROR_RETURN
        (soc_reg_fields32_modify(unit, L2_AUX_HASH_CONTROLr, REG_PORT_ANY, 3,
                                 fields, values));
    SOC_IF_ERROR_RETURN
        (soc_reg_fields32_modify(unit, L3_AUX_HASH_CONTROLr, REG_PORT_ANY, 3,
                                 fields, values));
    SOC_IF_ERROR_RETURN
        (soc_reg_field32_modify(unit, MPLS_ENTRY_HASH_CONTROLr, REG_PORT_ANY,
                                INSERT_LEAST_FULL_HALFf, 1));
    /*
     * IPMC init
     */
    SOC_IF_ERROR_RETURN(READ_RQE_GLOBAL_CONFIGr(unit, &rval));
    soc_reg_field_set(unit,RQE_GLOBAL_CONFIGr, &rval, PARITY_GEN_ENf,
                      1);
    soc_reg_field_set(unit,RQE_GLOBAL_CONFIGr, &rval, PARITY_CHK_ENf,
                      1);
    SOC_IF_ERROR_RETURN(WRITE_RQE_GLOBAL_CONFIGr(unit, rval));

    /* Egress Disable */
    sal_memset(entry, 0, sizeof(egr_enable_entry_t));
    soc_mem_field32_set(unit, EGR_ENABLEm, entry, PRT_ENABLEf, 0);
    for (port = 0; port <= si->lb_port; port++) {
        rv = WRITE_EGR_ENABLEm(unit, MEM_BLOCK_ALL, port, entry);
        /* ****************************************************************** */
        
        /* ****************************************************************** */
        if (SOC_FAILURE(rv)) {
            if (rv == _SHR_E_PARAM) {
                continue;
            }
            return rv;
        }
    }

#if 0    
    SOC_IF_ERROR_RETURN(READ_DEQ_EFIFO_CFG_COMPLETEr(unit, &rval));
    soc_reg_field_set(unit, DEQ_EFIFO_CFG_COMPLETEr, &rval, \
            EGRESS_FIFO_CONFIGURATION_COMPLETEf, 0);
    SOC_IF_ERROR_RETURN(WRITE_DEQ_EFIFO_CFG_COMPLETEr(unit, rval));
#endif
    
    sal_memset(entry, 0, sizeof(epc_link_bmap_entry_t));
    soc_mem_pbmp_field_set(unit, EPC_LINK_BMAPm, entry, PORT_BITMAPf,
                           &PBMP_CMIC(unit));
    SOC_IF_ERROR_RETURN(WRITE_EPC_LINK_BMAPm(unit, MEM_BLOCK_ALL, 0, entry)); 

    SOC_IF_ERROR_RETURN(READ_ING_CONFIG_64r(unit, &reg64));
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          L3SRC_HIT_ENABLEf, 1);
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          L2DST_HIT_ENABLEf, 1);
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          APPLY_EGR_MASK_ON_L2f, 1);
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          APPLY_EGR_MASK_ON_L3f, 1);
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          ARP_RARP_TO_FPf, 0x3); /* enable both ARP & RARP */
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          ARP_VALIDATION_ENf, 1);
    soc_reg64_field32_set(unit, ING_CONFIG_64r, &reg64,
                          IGNORE_HG_HDR_LAG_FAILOVERf, 1);
    SOC_IF_ERROR_RETURN(WRITE_ING_CONFIG_64r(unit, reg64));
    /* The HW defaults for EGR_VLAN_CONTROL_1.VT_MISS_UNTAG == 1, which
     * causes the outer tag to be removed from packets that don't have
     * a hit in the egress vlan tranlation table. Set to 0 to disable this.
     */
    rval = 0;
    soc_reg_field_set(unit, EGR_VLAN_CONTROL_1r, &rval, VT_MISS_UNTAGf, 0);

    /* Enable pri/cfi remarking on egress ports. */
    soc_reg_field_set(unit, EGR_VLAN_CONTROL_1r, &rval, REMARK_OUTER_DOT1Pf,
                      1);
    PBMP_ALL_ITER(unit, port) {
        SOC_IF_ERROR_RETURN(WRITE_EGR_VLAN_CONTROL_1r(unit, port, rval));
    }

    SOC_PBMP_ASSIGN(pbmp, PBMP_ALL(unit));
    SOC_PBMP_REMOVE(pbmp, PBMP_LB(unit));
    SOC_IF_ERROR_RETURN(soc_mem_read(unit, ING_EN_EFILTER_BITMAPm,
                                     MEM_BLOCK_ANY, 0, &entry));
    soc_mem_pbmp_field_set(unit, ING_EN_EFILTER_BITMAPm, &entry, BITMAPf,
                           &pbmp);
    SOC_IF_ERROR_RETURN(soc_mem_write(unit, ING_EN_EFILTER_BITMAPm,
                                      MEM_BLOCK_ANY, 0, &entry));
    SOC_IF_ERROR_RETURN(READ_CMIC_TXBUF_CONFIGr(unit, &rval));
    soc_reg_field_set(unit, CMIC_TXBUF_CONFIGr, &rval,
                            FIRST_SERVE_BUFFERS_WITH_EOP_CELLSf, 0);
    /* coverity[result_independent_of_operands] */
    SOC_IF_ERROR_RETURN(WRITE_CMIC_TXBUF_CONFIGr(unit, rval));

    /* Multicast range initialization */
    SOC_IF_ERROR_RETURN
        (soc_hbx_higig2_mcast_sizes_set(unit,
             soc_property_get(unit, spn_HIGIG2_MULTICAST_VLAN_RANGE,
                              SOC_HBX_MULTICAST_RANGE_DEFAULT),
             soc_property_get(unit, spn_HIGIG2_MULTICAST_L2_RANGE,
                              SOC_HBX_MULTICAST_RANGE_DEFAULT),
             soc_property_get(unit, spn_HIGIG2_MULTICAST_L3_RANGE,
                              SOC_HBX_MULTICAST_RANGE_DEFAULT)));
#if 0
    if (soc_mspi_init(unit) != SOC_E_NONE) {
        LOG_ERROR(BSL_LS_SOC_COMMON, (BSL_META_U(unit, "unit %d : MSPI Init Failed\n"), unit));
    }
#endif
    SOC_IF_ERROR_RETURN(soc_mem_clear(
                        unit, MMU_RQE_QUEUE_OP_NODE_MAPm, COPYNO_ALL, TRUE));
    SOC_IF_ERROR_RETURN(soc_mem_clear(
                        unit, MMU_WRED_QUEUE_OP_NODE_MAPm, COPYNO_ALL, TRUE));
    
    SOC_IF_ERROR_RETURN(_soc_metrolite_get_cfg_num(unit, 0, &cfg_num));
    if (cfg_num >= (sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))) {
        LOG_WARN(BSL_LS_SOC_COMMON, (BSL_META_U(unit,
                   "Wrong cfg_num:%d exceeding max cfg_num: %d\n"),
                   cfg_num,
                   (int)(sizeof(bcm56270_tdm)/sizeof(bcm56270_tdm[0]))));
        return SOC_E_FAIL;
    }

    PBMP_ALL_ITER(unit, port) { 
        if ((port == 0 ) || (port >= 13)) {
            continue;
        }
        SOC_IF_ERROR_RETURN(soc_metrolite_port_init_config(unit, cfg_num, port));
    }
    
    SOC_IF_ERROR_RETURN(READ_AUX_ARB_CONTROL_2r(unit, &rval));
    soc_reg_field_set(unit, AUX_ARB_CONTROL_2r, &rval,
            TCAM_ATOMIC_WRITE_ENABLEf, 1);
    SOC_IF_ERROR_RETURN(WRITE_AUX_ARB_CONTROL_2r(unit, rval));

    /* Setup SW2_FP_DST_ACTION_CONTROL */
    fields[0] = HGTRUNK_RES_ENf;
    values[0] = 1;
    fields[1] = LAG_RES_ENf;
    values[1] = 1;
    SOC_IF_ERROR_RETURN(soc_reg_fields32_modify(unit,
                SW2_FP_DST_ACTION_CONTROLr, REG_PORT_ANY, 2, fields, values));

    /* In SB2, hardware logic for key/mask encoding and decoding is disabled */
    SOC_IF_ERROR_RETURN(READ_EGR_BYPASS_CTRLr(unit, &rval));
    soc_reg_field_set(unit, EGR_BYPASS_CTRLr, &rval,
            EFP_SW_ENC_DEC_TCAMf, 1);
    SOC_IF_ERROR_RETURN(WRITE_EGR_BYPASS_CTRLr(unit, rval));
#if 0    
#ifdef INCLUDE_AVS
    soc_saber2_avs_init(unit);
#endif /* INCLUDE_AVS  */

    /* initializing ts pll and bs pll */
    _soc_saber2_tspll_bspll_config(unit);
#endif

    /* Initializing subport configurations */
    si->subport_group_max = SOC_ML_SUBPORT_GROUP_MAX;
    si->subport_port_max = SOC_ML_MAX_SUBPORTS;
    si->pp_port_index_min = SOC_ML_SUBPORT_PP_PORT_INDEX_MIN;
    si->pp_port_index_max = SOC_ML_SUBPORT_PP_PORT_INDEX_MAX;
    si->lp_tx_databuf_start_addr_max = SOC_ML_LINKPHY_TX_DATA_BUF_START_ADDR_MAX;
    si->lp_tx_databuf_end_addr_min = SOC_ML_LINKPHY_TX_DATA_BUF_END_ADDR_MIN;
    si->lp_tx_databuf_end_addr_max = SOC_ML_LINKPHY_TX_DATA_BUF_END_ADDR_MAX;
    si->lp_tx_stream_start_addr_offset = SOC_ML_LINKPHY_TX_STREAM_START_ADDR_OFFSET;
    si->lp_block_max = SOC_ML_MAX_LINKPHY_BLOCK;
    si->lp_ports_max = SOC_ML_MAX_LINKPHY_PORTS;
    si->lp_streams_per_slice_max = SOC_ML_MAX_LINKPHY_STREAMS_PER_SLICE;
    si->lp_streams_per_port_max = SOC_ML_MAX_LINKPHY_STREAMS_PER_PORT;
    si->lp_streams_per_subport = SOC_ML_MAX_LINKPHY_STREAMS_PER_SUBPORT;

    return SOC_E_NONE;
}

/* *************************************************************** */
/* METROLITE MMU HELPER  --- START(As per Metrolie_MMU_Settings-5.xls */
/* *************************************************************** */
/* Dynamic/SetLater Parameter */
typedef struct _soc_ml_mmu_params {
               uint32 mmu_min_pkt_size;                   /*C5*/
               uint32 mmu_ethernet_mtu_bytes;             /*C6*/
               uint32 mmu_max_pkt_size;                   /*C7*/
               uint32 mmu_jumbo_frame_size;               /*C8*/
               uint32 mmu_int_buf_cell_size;              /*C9*/
               uint32 mmu_pkt_header_size;                /*C10*/
               uint32 lossless_mode_d_c;                  /*C11*/
               uint32 pfc_pause_mode_d_c;                 /*C12*/
               uint32 mmu_lossless_pg_num;                /*C13*/
               uint32 num_ge_ports_d;                     /*C14*/
               uint32 mmu_line_rate_ge;                   /*C15*/
               uint32 num_ge_int_ports_d;                 /*C14*/
               uint32 num_egr_queue_per_int_ge_port_d;    /*C16*/
               uint32 num_hg_ports_d;                     /*C17*/
               uint32 mmu_line_rate_hg;                   /*C18*/
               uint32 num_hg_int_ports_d;                 /*C17*/
               uint32 num_egr_queue_per_int_hg_port_d;    /*C19 */
               uint32 mmu_num_cpu_port;                   /*C20*/
               uint32 mmu_num_cpu_queue;                  /*C21*/
               uint32 mmu_num_loopback_port;              /*C22*/
               uint32 mmu_num_loopback_queue;             /*C35*/
               uint32 mmu_num_ep_redirection_queue;       /*C36*/
               uint32 mmu_num_olp_port_d;                 /*C37*/
               uint32 mmu_num_olp_queue;                  /*C38*/
               uint32 olp_port_int_ext_bounding_d_c;      /*C39:Dynamic*/
               uint32 mmu_total_egress_queue;             /*C40*/
               uint32 mmu_pipeline_lat_cpap_admission;    /*C41*/
               uint32 mmu_int_buf_size;                   /*C42:2048KB=2MB*/
               uint32 mmu_available_int_buf_size_d;       /*C43:1434KB */
               uint32 mmu_reserved_int_buf_cells;         /*C44:100 Cells */
               uint32 mmu_reserved_int_buf_ema_pool_size_d; /*C45:614KB */
               uint32 internal_buffer_reduction_d_c;        /* C46:Dynamic */
               uint32 mmu_ext_buf_size;                   /*C47:737280KB=720MB*/
               uint32 mmu_reserved_ext_buf_space_cfap;    /*C48:737280KB=720MB*/
               uint32 mmu_egress_queue_entries;           /*C49*/
               uint32 mmu_ep_redirect_queue_entries;      /*C50*/
               uint32 mmu_exp_num_of_repl_per_pkt;        /*C51*/
               uint32 mmu_repl_engine_work_queue_entries; /*C52*/
               uint32 mmu_resv_repl_engine_work_queue_entries; /*C53*/
               uint32 mmu_repl_engine_work_queue_in_device;/*C54*/
               uint32 mmu_ema_queues;                     /*C55*/
               uint32 num_cells_rsrvd_ing_ext_buf;        /* C56:Dynamic */
               uint32 per_cos_res_cells_for_int_buff_d;   /* C58:Dynamic */
               uint32 per_cos_res_cells_for_ext_buff_d;   /* C59:Dynamic */
               uint32 mmu_ing_port_dyn_thd_param;         /*C60*/
               uint32 mmu_ing_pg_dyn_thd_param;           /*C61*/
               uint32 mmu_egr_queue_dyn_thd_param_baf;        /*C62*/
               uint32 mmu_egr_queue_dyn_thd_param_baf_profile_lossy;           /*C63*/
               uint32 mmu_ing_cell_buf_reduction;         /*C64 */
               uint32 mmu_ing_pkt_buf_reduction;          /*C65 */
} _soc_ml_mmu_params_t;

typedef struct _general_info {
    uint32 max_packet_size_in_cells;                         /* C72 */
    uint32 jumbo_frame_for_int_buff;                         /* C73 */
    uint32 jumbo_frame_for_ext_buff;                         /* C74 */
    uint32 ether_mtu_cells_for_int_buff;                     /* C76 */
    uint32 ether_mtu_cells_for_ext_buff;                     /* C77 */
    uint32 total_num_of_ports;                               /* C79 */
    uint32 total_num_of_ports_excl_lpbk;                     /* C80 */
    uint32 total_num_of_ports_excl_lpbk_olp;                 /* C81 */
    uint32 total_num_of_ports_excl_lpbk_olp_cpu;             /* C82 */
    uint32 port_bw_bound_to_ext_buff;                        /* C83 */
    uint32 total_egr_queues_for_a_int_ge_ports;              /* C84 */
    uint32 total_egr_queues_for_a_ext_ge_ports;              /* C85 */
    uint32 total_egr_queues_for_a_int_hg_ports;              /* C86 */
    uint32 total_egr_queues_for_a_ext_hg_ports;              /* C87 */
    uint32 total_cpu_queues;                                 /* C88 */
    uint32 total_base_queue_int_buff;                       /* C89 */
    uint32 total_base_queue_ext_buff;                        /* C90 */
    uint32 total_ema_queues;                                 /* C91 */
    uint32 total_egr_base_queues_in_device;                  /* C93 */
    uint32 total_egr_queues_in_device;                       /* C94 */
    uint32 max_int_cell_buff_size;                           /* C95 */
    uint32 int_cell_buff_size_after_limitation;              /* C96 */
    uint32 src_packing_fifo;                                 /* C97 */
    uint32 int_buff_pool;                                    /* C98 */
    uint32 ema_pool;                                         /* C99 */
    uint32 max_ext_cell_buff_size;                           /* C100 */
    uint32 repl_engine_work_queue_entries;                   /* C101 */
    uint32 ratio_of_ext_buff_to_int_buff_size;               /* C103 */
    uint32 int_buff_cells_per_avg_size_pkt;                  /* C104 */
    uint32 ext_buff_cells_per_avg_size_pkt;                  /* C105 */
    uint32 max_prop_of_buff_used_by_one_queue_port;          /* C106 */
}_general_info_t;

typedef struct _input_port_threshold_t {
    uint32 global_hdrm_cells_for_int_buff_ingress_pool;      /* C110 */
    uint32 global_hdrm_cells_for_int_buff_ema_pool;          /* C111 */
    uint32 global_hdrm_cells_for_ext_buff_pool;              /* C112 */
    uint32 global_hdrm_cells_for_RE_WQEs;                    /* C113 */
    uint32 global_hdrm_cells_for_EQEs;                       /* C114 */

    uint32 hdrm_int_buff_cells_for_10G_PG;                   /* C115 */
    uint32 hdrm_ema_buff_cells_for_10G_PG;                   /* C116 */
    uint32 hdrm_ext_buff_cells_for_10G_PG;                   /* C117 */
    uint32 hdrm_RE_WQEs_pkts_for_10G_PG;                     /* C118 */
    uint32 hdrm_EQEs_pkts_for_10G_PG;                        /* C119 */

    uint32 hdrm_int_buff_cells_for_10G_total_PG;             /* C120 */
    uint32 hdrm_ema_buff_cells_for_10G_total_PG;             /* C121 */
    uint32 hdrm_ext_buff_cells_for_10G_total_PG;             /* C122 */
    uint32 hdrm_RE_WQEs_pkts_for_10G_total_PG;               /* C123 */
    uint32 hdrm_EQEs_pkts_for_10G_total_PG;                  /* C124 */

    uint32 hdrm_int_buff_cells_for_1G_PG;                    /* C125 */
    uint32 hdrm_ema_buff_cells_for_1G_PG;                    /* C126 */
    uint32 hdrm_ext_buff_cells_for_1G_PG;                    /* C127 */
    uint32 hdrm_RE_WQEs_pkts_for_1G_PG;                      /* C128 */
    uint32 hdrm_EQEs_pkts_for_1G_PG;                         /* C129 */

    uint32 hdrm_int_buff_cells_for_1G_total_PG;              /* C130 */
    uint32 hdrm_ema_buff_cells_for_1G_total_PG;              /* C131 */
    uint32 hdrm_ext_buff_cells_for_1G_total_PG;              /* C132 */
    uint32 hdrm_RE_WQEs_pkts_for_1G_total_PG;                /* C133 */
    uint32 hdrm_EQEs_pkts_for_1G_total_PG;                   /* C134 */

    uint32 hdrm_int_buff_cells_for_olp_port;                 /* C135 */
    uint32 hdrm_ema_buff_cells_for_olp_port;                 /* C136 */
    uint32 hdrm_ext_buff_cells_for_olp_port;                 /* C137 */
    uint32 hdrm_RE_WQEs_pkts_for_olp_port;                   /* C138 */
    uint32 hdrm_EQEs_pkts_for_olp_port;                      /* C139 */

    uint32 hdrm_int_buff_cells_for_lpbk_port;                /* C140 */
    uint32 hdrm_ema_buff_cells_for_lpbk_port;                /* C141 */
    uint32 hdrm_ext_buff_cells_for_lpbk_port;                /* C142 */
    uint32 hdrm_RE_WQEs_pkts_for_lpbk_port;                  /* C143 */
    uint32 hdrm_EQEs_pkts_for_lpbk_port;                     /* C144 */

    uint32 hdrm_int_buff_cells_for_cpu_port;                 /* C145 */
    uint32 hdrm_ema_buff_cells_for_cpu_port;                 /* C146 */
    uint32 hdrm_ext_buff_cells_for_cpu_port;                 /* C147 */
    uint32 hdrm_RE_WQEs_pkts_for_cpu_port;                   /* C148 */
    uint32 hdrm_EQEs_pkts_for_cpu_port;                      /* C149 */

    uint32 total_hdrm_int_buff_cells;                        /* C150 */
    uint32 total_hdrm_int_buff_ema_pool_cells;               /* C151 */
    uint32 total_hdrm_ext_buff_cells;                        /* C152 */
    uint32 total_hdrm_RE_WQEs_pkts;                          /* C153 */
    uint32 total_hdrm_EQEs_pkts;                             /* C154 */

    uint32 min_int_buff_cells_per_PG;                        /* C156 */
    uint32 min_int_buff_ema_pool_cells_per_PG;               /* C157 */
    uint32 min_ext_buff_cells_per_PG;                        /* C158 */
    uint32 min_RE_WQEs_pkt_per_PG;                           /* C159 */
    uint32 min_EQEs_pkt_per_PG;                              /* C160 */

    uint32 min_int_buff_cells_for_total_PG;                  /* C162 */
    uint32 min_int_buff_ema_pool_cells_for_total_PG;         /* C163 */
    uint32 min_ext_buff_cells_for_total_PG;                  /* C164 */
    uint32 min_RE_WQEs_pkts_for_total_PG;                    /* C165 */
    uint32 min_EQEs_pkts_for_total_PG;                       /* C166 */

    uint32 min_int_buff_cells_for_a_port;                    /* C168 */
    uint32 min_int_buff_ema_pool_cells_for_a_port;           /* C169 */
    uint32 min_ext_buff_cells_for_a_port;                    /* C170 */
    uint32 min_RE_WQEs_pkts_for_a_port;                      /* C171 */
    uint32 min_EQEs_pkts_for_a_port;                         /* C172 */

    uint32 min_int_buff_cells_for_total_port;                /* C174 */
    uint32 min_int_buff_ema_pool_cells_for_total_port;       /* C175 */
    uint32 min_ext_buff_cells_for_total_port;                /* C176 */
    uint32 min_RE_WQEs_pkts_for_total_port;                  /* C177 */
    uint32 min_EQEs_pkts_for_total_port;                     /* C178 */

    uint32 total_min_int_buff_cells;                         /* C180 */
    uint32 total_min_int_buff_ema_pool_cells;                /* C181 */
    uint32 total_min_ext_buff_cells;                         /* C182 */
    uint32 total_min_RE_WQEs_pkts;                           /* C183 */
    uint32 total_min_EQEs_pkts;                              /* C184 */

    uint32 total_shared_ing_buff_pool;                       /* C186 */
    uint32 total_shared_EMA_buff;                            /* C187 */
    uint32 total_shared_ext_buff;                            /* C188 */
    uint32 total_shared_RE_WQEs_buff;                        /* C189 */
    uint32 total_shared_EQEs_buff;                           /* C190 */

    uint32 ingress_burst_cells_size_for_one_port;            /* C192 */
    uint32 ingress_burst_pkts_size_for_one_port;             /* C193 */
    uint32 ingress_burst_cells_size_for_all_ports;           /* C194 */
    uint32 ingress_total_shared_cells_use_for_all_port;      /* C195 */
    uint32 ingress_burst_pkts_size_for_all_port;             /* C196 */
    uint32 ingress_total_shared_pkts_use_for_all_port;       /* C197 */
    uint32 ingress_total_shared_hdrm_cells_use_for_all_port; /* C198 */
    uint32 ingress_total_shared_hdrm_pkts_use_for_all_port;  /* C199 */

}_input_port_threshold_t;

typedef struct _output_port_threshold_t {
    uint32 min_grntd_res_queue_cells_int_buff;               /* C204 */
    uint32 min_grntd_res_queue_cells_ext_buff;               /* C205 */
    uint32 min_grntd_res_queue_cells_EQEs;                   /* C206 */
    uint32 min_grntd_res_EMA_queue_cells;                    /* C207 */
    uint32 min_grntd_res_RE_WQs_cells;                       /* C208 */
    uint32 min_grntd_res_RE_WQs_queue_cells_for_int_buff;    /* C209 */
    uint32 min_grntd_res_RE_WQs_queue_cells_for_ext_buff;    /* C210 */
    uint32 min_grntd_res_EP_redirect_queue_entry_cells;      /* C211 */

    uint32 min_grntd_tot_res_queue_cells_int_buff;           /* C213 */
    uint32 min_grntd_tot_res_queue_cells_ext_buff;           /* C214 */
    uint32 min_grntd_tot_res_queue_cells_EQEs;               /* C215 */
    uint32 min_grntd_tot_res_EMA_queue_cells;                /* C216 */
    uint32 min_grntd_tot_res_RE_WQs_cells;                   /* C217 */
    uint32 min_grntd_tot_res_RE_WQs_queue_cells_for_int_buff;/* C218 */
    uint32 min_grntd_tot_res_RE_WQs_queue_cells_for_ext_buff;/* C219 */
    uint32 min_grntd_tot_res_EP_redirect_queue_entry_cells;  /* C220 */

    uint32 min_grntd_tot_shr_queue_cells_int_buff;           /* C222 */
    uint32 min_grntd_tot_shr_queue_cells_ext_buff;           /* C223 */
    uint32 min_grntd_tot_shr_queue_cells_EQEs;               /* C224 */
    uint32 min_grntd_tot_shr_EMA_queue_cells;                /* C225 */
    uint32 min_grntd_tot_shr_RE_WQs_cells;                   /* C226 */
    uint32 min_grntd_tot_shr_RE_WQs_queue_cells_for_int_buff;/* C227 */
    uint32 min_grntd_tot_shr_RE_WQs_queue_cells_for_ext_buff;/* C228 */
    uint32 min_grntd_tot_shr_EP_redirect_queue_entry_cells;  /* C229 */

    uint32 egress_queue_dynamic_threshold_parameter;         /* C230 */
    uint32 egress_burst_cells_size_for_one_queue;            /* C231 */
    uint32 egress_burst_pkts_size_for_one_queue;             /* C232 */
    uint32 egress_burst_cells_size_for_all_ports;            /* C233 */
    uint32 egress_burst_pkts_size_for_all_ports;             /* C234 */
    uint32 egress_burst_cells_size_for_all_queues;           /* C235 */
    uint32 egress_burst_pkts_size_for_all_queues;            /* C236 */
    uint32 egress_total_use_in_cells_for_all_queues;         /* C237 */
    uint32 egress_total_use_in_pkts_for_all_queues;          /* C238 */
    uint32 egress_remaining_cells_for_all_queues;            /* C239 */
    uint32 egress_remaining_pkts_for_all_queues;             /* C240 */

}_output_port_threshold_t;

typedef struct _soc_ml_mmu_intermediate_results {
    _general_info_t           general_info;
    _input_port_threshold_t   input_port_threshold;
    _output_port_threshold_t  output_port_threshold;
}_soc_ml_mmu_intermediate_results_t;

_soc_ml_mmu_intermediate_results_t _soc_ml_mmu_intermediate_results={{0}};

void soc_metrolite_block_reset(int unit, uint8 block,int active_low) {
    uint32 rval;
    soc_field_t hot_swap_reset_fld[]={
        TOP_MXQ_HOTSWAP_RST_Lf
        };

    if (READ_TOP_SOFT_RESET_REGr(unit, &rval) != SOC_E_NONE) {
        LOG_CLI((BSL_META_U(unit,
                        "ATTN: Reading TOP_SOFT_RESET_REG failed \n")));
        return;
    }
    soc_reg_field_set(unit, TOP_SOFT_RESET_REGr, &rval,
            hot_swap_reset_fld[block],active_low);
    /* coverity[check_return] */
    WRITE_TOP_SOFT_RESET_REGr(unit, rval);
}

STATIC
